"Historia systemów komputerowych. Generacje komputerów oraz procesorów. Przerwa wydajnościowa. Prawo Moore’a. Asembler procesorów Intel x86 (przez DosBox). Organizacja systemów jednoprocesorowych (elementy tradycyjnej organizacji komputerów). Architektura von Neumanna oraz modyfikacje (architektura Harvard). Budowa procesora, pamięci oraz urządzeń magistrali systemowej. Zasady wykonywania programu w systemie komputerowym.  Metody programowania maszyn CISC i RISC (wykorzystanie rejestrów procesora, operacje  arytmetyczne i na łańcuchach znakowych). Reprezentacja danych w systemie komputerowym. Kod dwójkowy, reprezentacje liczb całkowitych i zmiennoprzecinkowych. Operacje arytmetyczne w kodzie dwójkowym. Norma IEEE 754. Budowa podstawowych układów sprzętowych do realizacji operacji arytmetycznych i logicznych. Jednostka arytmetyczno-logiczna i zmiennoprzecinkowa.  Wykorzystanie stosu, rejestrów indeksowych, zmiennoprzecinkowych i MMX. Polecenia (rozkazy) i argumenty instrukcji maszynowych. Wykorzystanie rozkazów. Rejestry procesora. Rozkazy do obliczeń wektorowych. Programowanie niskiego poziomu – asembler, tryby dostępu do pamięci, tryby adresowania w rozkazach. Stos. Współdziałanie programu z systemem operacyjnym, zarządzanie pamięcią. Metody adresowania i wykorzystanie ich w rozkazach. Klasyfikacja pamięci. Efektywność pamięci i procesora. Parametry czasowe pamięci. Pamięć główna, zewnętrzna (wirtualna) i podręczna. Tworzenie wstawek asemblerowych w języku wysokiego poziomu. Pamięci masowe – organizacja i zarządzanie. Pamięć wirtualna. Struktura fizyczna przechowywania danych na dysku.Wykorzystanie jednostki zmiennoprzecinkowej. Urządzenia wejścia-wyjścia. Parametry wydajnościowe urządzeń peryferyjnych. Sposoby komunikacji z urządzeniami zewnętrznymi. Moduły wejścia-wyjścia. Magistrale rozszerzeń. Technologia DMA.  Zastosowanie powyższych elementów do tworzenia prostych programów wykonujących operacje matematyczne oraz na łańcuchach znakowych. Organizacja współczesnych procesorów: architektury potokowe, superpotokowe i superskalarne. Procesory wielowątkowe i wektorowe.   Programowanie w trybie 16- i 32-bitowym. Wykorzystanie API Win32. Porównanie architektur RISC i CISC. Architektura IA-64. Asembler procesorów MIPS 2000 (poprzez symulator PC-Spim). "