{"Wstęp do programowania": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "W1": "Student zna i rozumie podstawowe typy danych.", "W2": "Student zna i rozumie instrukcję warunkową oraz sposoby wielokrotnego wykonywania instrukcji w prostym programie komputerowym.", "U1": "Student potrafi wykorzystać podstawowe typy danych w prostym programie komputerowym.", "U2": "Student potrafi sterować warunkowym oraz wielokrotnym wykonywaniem instrukcji w prostym programie komputerowym.", "U3": "Student potrafi wykorzystać mechanizm funkcji w prostych programach komputerowych.", "U4": "Student potrafi określić zasięg zmiennych w blokach użytkownika w formie tekstowej bądź graficznej.", "U5": "Student potrafi wykorzystać środowisko programistyczne do tworzenia prostych programów komputerowych."}, "Podstawy matematyki wyższej": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie reguły rachunku zdań i ich związek z operacjami na zbiorach (suma, przecięcie). Rozumie różnicę miedzy liczbami wymiernymi a niewymiernymi.", "U1": "Student potrafi znaleźć przecięcia i sumy podzbiorów płaszczyzny (również przeliczalne) i je naszkicować.", "K1": "Student jest gotów do przygotowania i przedstawienia wyników swojej pracy indywidualnej lub zespołowej.", "W2": "Student zna i rozumie pojęcie odwzorowania i funkcji, odwzorowania odwracalnego; zna podstawowe własności funkcji elementarnych.", "U2": "Student potrafi zbadać czy dana funkcja jest odwracalna , potrafi rozwiązywać równania i nierówności z funkcjami elementarnymi.", "W3": "Student zna i rozumie różne postaci równania prostej i  równania krzywych stożkowych.", "U3": "Student potrafi zaznaczyć na płaszczyźnie zbiory zadane równaniami i nierównościami liniowymi i (niektórymi) kwadratowymi. Potrafi rozpoznać krzywą stożkową (bez obrotów) i naszkicować ją w układzie współrzędnych, potrafi napisać równanie stożkowej o zadanych własnościach.", "W4": "Student zna i rozumie pojęcie liczby zespolonej i podstawowe operacje na ;liczbach zespolonych.", "U4": "Student potrafi rozwiązać równanie kwadratowe o wsp. zespolonych, potrafi zaznaczyć na płaszczyźnie zespolonej podzbiory o zadanych własnościach, potrafi znaleźć pierwiastki z liczby zespolonej.", "W5": "Student zna i rozumie pojęcie macierzy, wyznacznika i ich związek z układami równań liniowych.", "U5": "Student potrafi efektywnie (redukcja) rozwiązać układ równań liniowych, obliczyć wyznacznik macierzy i znaleźć macierz odwrotną."}, "Podstawy analizy matematycznej": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie podstawowe pojęcia analizy matematycznej.", "U1": "Student potrafi zastosować rachunek różniczkowy do badania funkcji w zadaniach praktycznych;", "U3": "Student potrafi formułować proste problemy w języku matematyki;", "K1": "Student jest gotów do przygotowania i przedstawienia wyników swojej pracy indywidualnej lub zespołowej.", "U4": "Student potrafi stosować proste metody aproksymacyjne.", "U2": "Student potrafi stosować całki w zagadnieniach praktycznych;"}, "Matematyka dyskretna 1": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "W1": "Student zna i rozumie elementy logiki matematycznej, teorii mnogości i teorii relacji (wraz z elementami teorii funkcji) - przydatne do formułowania i rozwiązywania zadań związanych z informatyką.", "U1": "Student potrafi analizować problemy, wykonywać obliczenia, formułować uzasadnienia i poprawnie przeprowadzać wnioskowania logiczne oraz wykorzystywać nabytą wiedzę do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki."}, "Podstawy fizyki": {"": "Podgląd pdf", "IN_K3_W02_inz": "Absolwent zna i rozumie podstawowe zagadnienia w zakresie fizyki obejmujące m. in. elektromagnetyzm, lasery, fizykę półprzewodników i fizyczne podstawy budowy komputerów kwantowych.", "IN_K3_W03_inz": "Absolwent zna i rozumie podstawy w zakresie elektrotechniki, pozwalające zrozumieć elektronikę oraz dokonywać pomiarów wielkości elektrycznych.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "W1": "Student zna i rozumie podstawowe pojęcia, prawa, zasady, zależności i zjawiska fizyczne z zakresu mechaniki klasycznej, elektryczności i magnetyzmu oraz mechaniki kwantowej.", "U1": "Student potrafi rozwiązywać zadania rachunkowe z fizyki z wykorzystaniem rachunku różniczkowego i całkowego.", "U2": "Student potrafi analizując proste problemy z omawianych działów fizyki umie wykonać kilkustopniowe rozumowanie wykraczające poza podstawienie do gotowych wzorów."}, "Rozumowania algorytmiczne": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "W1": "Student zna i rozumie podstawowe metody i techniki rozwiązywania problemów algorytmicznych.", "U1": "Student potrafi wykorzystywać zdobytą wiedzę do analizy i praktycznego rozwiązywania problemów algorytmicznych."}, "Ergonomia i BHP": {"": "Podgląd pdf", "IN_K3_U20_inz": "Absolwent potrafi systematycznie przeprowadzać testy funkcjonalne, jest przygotowany do efektywnego uczestniczenia w inspekcji oprogramowania.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "U1": "Student potrafi wykorzystać wiedzę na temat środowiska pracy, a także jego stan prawny", "K1": "Student jest gotów do właściwego zachowania się w przypadku zagrożenia, jest świadom obowiązków pracownika i pracodawcy w czasie niebezpieczeństwa"}, "Programowanie obiektowe": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U12_inz": "Absolwent potrafi stworzyć model obiektowy prostego systemu (np. w języku UML).", "IN_K3_U14_inz": "Absolwent potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu.", "W1": "Student zna i rozumie podstawowe zasady programowania obiektowego. Rozumie znaczenie programowania obiektowego dla tworzenia dużych systemów informatycznych.", "W2": "Student zna i rozumie środowisko programistyczne wspierające pracę w wybranym obiektowym języku programowania, zna mechanizmy dziedziczenia i polimorfizmu, klasy abstrakcyjne oraz interfejsy.", "W3": "Student zna i rozumie przydatność paradygmatu obiektowego do rozwiązywania różnego typu problemów", "U1": "Student potrafi formułować algorytmy i je programować z użyciem języka obiektowego.", "U2": "Student potrafi dokonać obiektowej analizy dziedziny i  zaprojektować strukturę klas dla danego zagadnienia.", "U3": "Student potrafi ocenić przydatność środowiska programistycznego wspierającego pracę w wybranym obiektowym języku programowania. Potrafi wybrać i używać narzędzia do projektowania, implementowania, testowania i debugowania  programów obiektowych."}, "Analiza matematyczna": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie pojęcia analizy matematycznej przedstawiane na wykładzie.", "U1": "Student potrafi rozwijać funkcje w szeregi potęgowe i trygonometryczne.", "K1": "Student jest gotów do przygotowania i przedstawienia wyników swojej pracy indywidualnej lub zespołowej.", "U2": "Student potrafi stosować rachunek różniczkowy do wyznaczania wartości ekstremalnych.", "U3": "Student potrafi stosować całki wielokrotne w zadaniach praktycznych.", "U4": "Student potrafi przedstawić prosty proces za pomocą równania różniczkowego."}, "Algebra liniowa": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie na rozszerzonym poziomie własności macierzy (w tym macierzy odwzorowań liniowych) i ich zastosowania.", "K1": "Student jest gotów do przygotowania i przedstawienia wyników swojej pracy indywidualnej lub zespołowej.", "U1": "Student potrafi rozwiązać zaawansowane układy równań liniowych i analizować ich własności.", "W2": "Student zna i rozumie pojęcie przestrzeni liniowej, jej bazy i wymiaru.", "W3": "Student zna i rozumie własności odwzorowań liniowych.", "U2": "Student potrafi zastosować własności iloczynu skalarnego w zagadnieniach dotyczących ortogonalności.", "U3": "Student potrafi wyznaczyć wartości i wektory własne macierzy oraz podać postać diagonalną macierzy.", "W4": "Student zna i rozumie wybrane pojęcia geometrii"}, "Podstawy elektroniki": {"": "Podgląd pdf", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W1": "Student zna i rozumie podstawy działania, analizy i obliczania układów elektronicznych oraz rozpoznaje komponenty bardziej złożonych układów, stosowanych także w technice komputerowej.", "U1": "Student potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "U2": "Student potrafi obliczać układy elektroniczne, stosować prawa i zasady obowiązujące przy analizie układów elektronicznych, prawidłowo dobierać metody obliczeniowe.", "K1": "Student jest gotów do kształcenia ustawicznego, rozumie tendencje zmian zachodzących w elektronice i w technikach komputerowych."}, "Matematyka dyskretna 2": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "W1": "Student zna i rozumie metody i techniki matematyki dyskretnej oraz ich związki z innymi działami matematyki.", "U1": "Student potrafi efektywnie wykorzystywać metody i techniki matematyki dyskretnej do rozwiązywania problemów matematycznych i informatycznych."}, "Laboratorium fizyki": {"": "Podgląd pdf", "IN_K3_W02_inz": "Absolwent zna i rozumie podstawowe zagadnienia w zakresie fizyki obejmujące m. in. elektromagnetyzm, lasery, fizykę półprzewodników i fizyczne podstawy budowy komputerów kwantowych.", "IN_K3_W03_inz": "Absolwent zna i rozumie podstawy w zakresie elektrotechniki, pozwalające zrozumieć elektronikę oraz dokonywać pomiarów wielkości elektrycznych.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "W1": "Student zna i rozumie podstawowe zasady pomiarów wielkości fizycznych", "W3": "Student zna i rozumie metody wykonywania pomiarów i szacowania błędów pomiarowych", "W5": "Student zna i rozumie zasady posługiwania się przyrządami pomiarowymi", "U2": "Student potrafi zaplanować i wykonać pomiar dowolnej wielkości fizycznej", "U3": "Student potrafi opracować wyniki danych pomiarowych", "U4": "Student potrafi dokumentować i terminowo raportować wyniki pracy", "K1": "Student jest gotów do pracy zespołowej", "K2": "Student jest gotów do przestrzegania zasad uczciwości i rzetelności", "K3": "Student jest gotów do jasnego raportowania i prezentowania wyników swojej pracy", "W2": "Student zna i rozumie podstawowe zasady komputerowego modelowania zjawisk fizycznych", "W4": "Student zna i rozumie narzędzia do tworzenia symulacji komputerowych zjawisk fizycznych", "U1": "Student potrafi wykonać modele prostych zjawisk fizycznych i na ich podstawie przeprowadzić symulację komputerową"}, "Psychologia": {"": "Podgląd pdf", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie podstawowe pojęcia psychologii: procesy poznawcze, spostrzeganie, odbiór i przetwarzanie informacji, mowę i język, myślenie i rozumowanie, uczenie się i pamięć, rolę uwagi, emocje i motywacje w procesach regulacji zachowania, zdolności i uzdolnienia, psychologię różnic indywidualnych – różnice w zakresie inteligencji, temperamentu, osobowości i stylu poznawczego", "U1": "Student potrafi obserwować zachowania społeczne i ich uwarunkowania\r\nradzić sobie ze stresem i stosować strategie radzenia sobie z trudnościami", "K1": "Student jest gotów do autorefleksji nad własnym rozwojem zawodowym"}, "Filozofia": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W12_inz": "Absolwent zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "IN_K3_W15_inz": "Absolwent zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie miejsce filozofii w systemie nauk realnych i zna elementarną terminologię używaną w filozofii. Student zna i rozumie źródła głównych sporów filozoficznych toczonych na gruncie ontologii, epistemologii i etyki. Student/ka zna przedmiotowych i metodologicznych powiązania filozofii z innymi dyscyplinami naukowymi, w tym społecznymi, przyrodniczymi i technicznymi. Student zna podstawowe spory światopoglądowe toczone na polu filozofii oraz ich źródła i\r\nuwarunkowania", "U1": "Student potrafi w oparciu o posiadaną wiedzę z zakresu filozofii krytycznie oceniać własne ograniczenia poznawcze i analizować filozoficzne aspekty zjawisk społecznych i ekonomicznych. Student/ka potrafi uczestniczyć w debacie na temat podstawowych sporów filozoficznych obejmujących zagadnienia z zakresu ontologii, epistemologii i etyki.", "K1": "Student jest gotów do krytycznej oceny swojej wiedzy oraz poszerzania wiedzy z zakresu filozofii i dyscyplin szczegółowych. Student/ka  jest gotów/a do uczestnictwa w dyskusji poświęconej podstawowym problemom etycznym."}, "Socjologia": {"": "Podgląd pdf", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie podstawy nauk społecznych, ich miejsce w systemie nauk i relacje do nauk ścisłych, technicznych.", "W2": "Student zna i rozumie podstawowe informacje o człowieku jako podmiocie tworzącym struktury społeczno-gospodarcze i zasady ich funkcjonowania, a także działającym w tych strukturach.", "U1": "Student potrafi analizować zjawiska społeczno-gospodarcze.", "K1": "Student jest gotów do wykorzystywania i przetwarzania informacji w celu pozyskania wiedzy niezbędnej w rozwoju osobistym oraz funkcjonowaniu w ramach społeczeństwa informacyjnego."}, "Algorytmy i struktury danych": {"": "Podgląd pdf", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "W1": "Student zna i rozumie podstawowe algorytmy oraz metody układania algorytmów (dziel i zwyciężaj, programowanie zachłanne i dynamiczne) i sposób ich wykorzystania w programach", "W2": "Student zna i rozumie podstawowe zagadnienia na temat złożoności obliczeniowej algorytmów i jej wpływu na praktyczne działanie systemów informatycznych", "U1": "Student potrafi potrafi wykorzystać wiedzę matematyczną do konstruowania i analizy algorytmów", "U3": "Student potrafi potrafi ocenić złożoność obliczeniową algorytmów i problemów", "U2": "Student potrafi ma umiejętność formułowania algorytmów dla zadań informatycznych oraz potrafi praktycznie ich programować i wykorzystywać dynamiczne struktury danych."}, "Inżynieria oprogramowania": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_W12_inz": "Absolwent zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U25_inz": "Absolwent potrafi poprawnie użyć przynajmniej jednej metody szacowania pracochłonności wytwarzania oprogramowania.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U12_inz": "Absolwent potrafi stworzyć model obiektowy prostego systemu (np. w języku UML).", "IN_K3_U20_inz": "Absolwent potrafi systematycznie przeprowadzać testy funkcjonalne, jest przygotowany do efektywnego uczestniczenia w inspekcji oprogramowania.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie inżynierię programowania i bazy danych", "W2": "Student zna i rozumie różnorodne narzędzia z inżynierii oprogramowania, w szczególności CASE.", "W3": "Student zna i rozumie metody tworzenia różnego typu zaawansowanego oprogramowania.", "U1": "Student potrafi tworzyć i analizować oprogramowania z wykorzystaniem narzędzi CASE.", "U2": "Student potrafi wykorzystywać szeroką wiedzę z zakresu analizy i modelowania różnych procesów z wykorzystaniem narzędzi IT.", "U3": "Student potrafi napisać test jednostkowy i integracyjny, potrafi prawidłowo znaleźć najczęściej popełniane błędy w kodzie, potrafi przeprowadzić testy systemowe i akceptacyjne.", "K1": "Student jest gotów do do pracy w projekcie zespołowym."}, "Architektura komputerów": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie budowę współczesnego systemu komputerowego", "W2": "Student zna i rozumie zasady wykonywania programu przez system komputerowy.", "W3": "Student zna i rozumie klasyfikację współczesnych systemów komputerowych ze względu na równoległość przetwarzania, rozmiar potoku, liczbę jednostek wykonawczych.", "W4": "Student zna i rozumie tryby adresowania i ich wpływ na budowę instrukcji maszynowych", "W5": "Student zna i rozumie struktury i zasady działania pamięci podręcznych", "W6": "Student zna i rozumie zasady działania i organizacji pamięci głównej oraz zarządzania nią przez system operacyjny.", "W7": "Student zna i rozumie współczesne trendy rozwojowe w sprzęcie komputerowym.", "U1": "Student potrafi programować w języku niskiego poziomu dla różnych architektur komputerowych.", "U2": "Student potrafi łączyć kod niskiego poziomu z językami wysokiego poziomu.", "K1": "Student jest gotów do rozumienia szybkość procesu zachodzenia zmian w technikach komputerowych i nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Rachunek prawdopodobieństwa i statystyka": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "W1": "Student zna i rozumie podstawowe schematy i wzory kombinatoryki, definicje doświadczenia losowego, zdarzenia elementarnego, zdarzenia losowego i przestrzeni probabilistycznej, zna także definicję oraz aksjomaty prawdopodobieństwa i wynikające z tych aksjomatów własności prawdopodobieństwa;", "W2": "Student zna i rozumie podstawowe wzory rachunku prawdopodobieństwa, pojęcie niezależności zdarzeń losowych;", "W3": "Student zna i rozumie pojęcie jednowymiarowej zmiennej losowej i jej rozkładu, definicje podstawowych charakterystyk tej zmiennej losowej, definicje oraz własności dystrybuanty i gęstości jednowymiarowej zmiennej losowej, własności wartości oczekiwanej oraz wariancji, najważniejsze rozkłady jednowymiarowych zmiennych losowych;", "W4": "Student zna i rozumie pojęcie dwuwymiarowej zmiennej losowej oraz definicje jej rozkładu łącznego i rozkładów brzegowych, definicje dystrybuanty oraz gęstości dwuwymiarowej zmiennej losowej, pojęcie niezależności zmiennych losowych;", "W5": "Student zna i rozumie podstawowe nierówności oraz twierdzenia graniczne rachunku prawdopodobieństwa;", "W6": "Student zna i rozumie podstawowe pojęcia statystyki matematycznej (wnioskowania statystycznego);", "W7": "Student zna i rozumie procedury weryfikacji hipotez statystycznych;", "W8": "Student zna i rozumie zagadnienia dotyczące estymacji punktowej oraz estymacji przedziałowej.", "U1": "Student potrafi określać przestrzenie probabilistyczne i zdarzenia losowe, wykonywać operacje na zdarzeniach losowych, umie identyfikować schematy kombinatoryczne oraz wykorzystywać wzory z kombinatoryki do obliczania prawdopodobieństw;", "U2": "Student potrafi rozwiązywać zadania z rachunku prawdopodobieństwa, korzystając z definicji prawdopodobieństwa klasycznego oraz prawdopodobieństwa geometrycznego, jak również wzorów na prawdopodobieństwo warunkowe i całkowite, wzoru Bayesa, wzoru włączeń i wyłączeń, wzoru łańcuchowego, umie także badać niezależność zdarzeń losowych oraz stosować schemat Bernoulliego;", "U3": "Student potrafi wyznaczać dystrybuanty i gęstości rozkładów jednowymiarowych zmiennych losowych, umie obliczać charakterystyki liczbowe zmiennych losowych;", "U4": "Student potrafi badać niezależność zmiennych losowych oraz wyznaczać rozkłady sum niezależnych zmiennych losowych;", "U5": "Student potrafi stosować ważniejsze nierówności oraz twierdzenia graniczne rachunku prawdopodobieństwa;", "U6": "Student potrafi wymienić i zdefiniować podstawowe pojęcia statystyki matematycznej (wnioskowania statystycznego);", "U7": "Student potrafi rozwiązywać zadania dotyczące weryfikowania hipotez statystycznych;", "U8": "Student potrafi obliczać wartości estymatorów punktowych oraz wyznaczać realizacje przedziałów ufności.", "K1": "Student jest gotów do efektywnego dzielenia się swoją wiedzą z rachunku prawdopodobieństwa oraz statystyki matematycznej z przedstawicielami różnych społecznie użytecznych profesji i dziedzin."}, "Laboratorium elektroniki": {"": "Podgląd pdf", "IN_K3_W03_inz": "Absolwent zna i rozumie podstawy w zakresie elektrotechniki, pozwalające zrozumieć elektronikę oraz dokonywać pomiarów wielkości elektrycznych.", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zasady łączenia układów elektronicznych.", "W2": "Student zna i rozumie sposób podłączania przyrządów pomiarowych do układu elektronicznego.", "U1": "Student potrafi dokonywać pomiarów wielkości elektrycznych, interpretować wyniki pomiarów.", "U2": "Student potrafi oceniać działanie układu elektronicznego za pomocą wzorów i odpowiednich charakterystyk oraz formułować właściwe wnioski.", "K1": "Student jest gotów do pracy zespołowej, dzielenia się kompetencjami."}, "Formy działalności gospodarczej": {"": "Podgląd pdf", "IN_K3_W12_inz": "Absolwent zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "IN_K3_W14_inz": "Absolwent zna i rozumie podstawy w zakresie prowadzenia działalności gospodarczej i zarządzania nią.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W2": "Student zna i rozumie podstawowe zagadnienia dotyczące prowadzenia działalności gospodarczej i zarządzania nią.", "W1": "Student zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "U1": "Student potrafi wybrać najkorzystniejszą formę prowadzenia działalności gospodarczej w zależności od zewnętrznych uwarunkowań rynkowych i wewnętrznych czynników ekonomicznych", "K1": "Student jest gotów do prowadzenia analiz ekonomicznych podmiotów gospodarczych funkcjonujących w różnych branżach", "U2": "Student potrafi sporządzić kompleksowy biznes plan własnego przedsięwzięcia gospodarczego", "K2": "Student jest gotów do podjęcia czynności w zakresie organizacji własnej działalności gospodarczej"}, "Budowa serwisów internetowych": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U19_inz": "Absolwent potrafi budować proste systemy bazodanowe, wykorzystujące przynajmniej jeden z najbardziej popularnych systemów zarządzania bazą danych oraz posiada umiejętność utrzymywania systemów bazodanowych", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "W1": "Student zna i rozumie zasadę działania technologii klient-serwer,", "W2": "Student zna i rozumie podstawowe języki i technologie internetowe", "U3": "Student potrafi stworzyć prosty interfejs użytkownika", "K1": "Student jest gotów do samodzielnego poszerzania wiedzy z technologii internetowych", "U1": "Student potrafi dobrać technologię do rozwiązania konkretnego problemu", "U2": "Student potrafi wykorzystywać bazy danych w budowie serwisów internetowych"}, "Wychowanie fizyczne": {"": "Podgląd pdf", "W1": "Student zna i rozumie jak wysiłek fizyczny wpływa na rozwój i funkcjonowanie organizmu.", "W3": "Student zna i rozumie w jaki sposób aktywność fizyczna wpływa na zdrowie na każdym etapie życia.", "U3": "Student potrafi zastosować różne formy aktywności ruchowej uwzględniające aktualny stan zdrowia, możliwości fizyczne i wiek.", "K3": "Student jest gotów do wzięcia odpowiedzialność za stan własnego zdrowia i innych, w tym także w przyszłości własnej rodziny.", "W2": "Student zna i rozumie aspekty morfologicznych, anatomicznych i fizjologicznych podstaw funkcjonowania organizmu ludzkiego oraz konsekwencji i zagrożeń związanych z brakiem aktywności ruchowej.", "W4": "Student zna i rozumie związek pomiędzy wysiłkiem i systematyczną pracą a uzyskanym efektem.", "U2": "Student potrafi przygotować organizm do wysiłku, kontrolować i oceniać stan wydolności organizmu, wykorzystać nabyte nawyki ruchowe w poprawnym wykonywaniu codziennych czynności ruchowych.", "K1": "Student jest gotów do sterowania własnym rozwojem fizycznym na każdym jego etapie, dbałości o ciało w zdrowiu i chorobie.", "U1": "Student potrafi dokonać analizy poziomu własnej sprawności fizycznej, prawidłowo zinterpretować i zidentyfikować występujące problemy w czasie wykonywania zadań i podejmować właściwe decyzje w celu ich rozwiązania.", "U4": "Student potrafi współpracować w zespole z zaangażowaniem i pełną odpowiedzialnością w celu uzyskania określonego wyniku.", "K2": "Student jest gotów do budowania relacji społecznych i umie to wykorzystać do osiągania celów indywidualnych i zespołowych.", "U5": "Student potrafi podejmować zadania adekwatne do własnych uzdolnień i możliwości."}, "Język angielski": {"": "Podgląd pdf", "IN_K3_U30": "Absolwent ma umiejęctności językowe w zakresie nauk technicznych, właściwych dla studiowanego kierunku studiów, zgodne z wymaganiami określonymi dla poziomu B2 Europejskiego Systemu Opisu Kształcenia Językowego.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "U1": "Student potrafi opisywać zjawiska, procesy, procedury.", "U2": "Student potrafi prowadzić korespondencję oraz sporządzać notatki.", "U3": "Student potrafi udzielać wyjaśnień, podawać przyczyny, wyrażać opinię lub przedstawiać plany.", "K1": "Student jest gotów do przygotowania i wygłaszania prezentacji.", "K2": "Student jest gotów do pracy w grupie i prowadzenia dyskusji", "K3": "Student jest gotów do porozumiewania się w większości sytuacji życia codziennego i zawodowego bez przygotowania."}, "Język niemiecki": {"": "Podgląd pdf", "IN_K3_U30": "Absolwent ma umiejęctności językowe w zakresie nauk technicznych, właściwych dla studiowanego kierunku studiów, zgodne z wymaganiami określonymi dla poziomu B2 Europejskiego Systemu Opisu Kształcenia Językowego.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "U1": "Student potrafi opisywać zjawiska, procesy, procedury.", "U2": "Student potrafi prowadzić korespondencję oraz sporządzać notatki.", "U3": "Student potrafi udzielać wyjaśnień, podawać przyczyny, wyrażać opinię lub przedstawiać plany.", "K1": "Student jest gotów do przygotowania i wygłaszania prezentacji.", "K2": "Student jest gotów do pracy w grupie i prowadzenia dyskusji", "K3": "Student jest gotów do porozumiewania się w większości sytuacji życia codziennego i zawodowego bez przygotowania."}, "Język rosyjski": {"": "Podgląd pdf", "IN_K3_U30": "Absolwent ma umiejęctności językowe w zakresie nauk technicznych, właściwych dla studiowanego kierunku studiów, zgodne z wymaganiami określonymi dla poziomu B2 Europejskiego Systemu Opisu Kształcenia Językowego.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "U1": "Student potrafi opisywać zjawiska, procesy, procedury.", "U2": "Student potrafi prowadzić korespondencję oraz sporządzać notatki.", "U3": "Student potrafi udzielać wyjaśnień, podawać przyczyny, wyrażać opinię lub przedstawiać plany.", "K1": "Student jest gotów do przygotowania i wygłaszania prezentacji.", "K2": "Student jest gotów do pracy w grupie i prowadzenia dyskusji.", "K3": "Student jest gotów do porozumiewania się w większości sytuacji życia codziennego i zawodowego bez przygotowania."}, "Język hiszpański": {"": "Podgląd pdf", "IN_K3_U30": "Absolwent ma umiejęctności językowe w zakresie nauk technicznych, właściwych dla studiowanego kierunku studiów, zgodne z wymaganiami określonymi dla poziomu B2 Europejskiego Systemu Opisu Kształcenia Językowego.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "U1": "Student potrafi opisywać zjawiska, procesy, procedury.", "U2": "Student potrafi prowadzić korespondencję oraz sporządzać notatki.", "U3": "Student potrafi udzielać wyjaśnień, podawać przyczyny, wyrażać opinię lub przedstawiać plany.", "K1": "Student jest gotów do przygotowania i wygłaszania prezentacji.", "K2": "Student jest gotów do pracy w grupie i prowadzenia dyskusji", "K3": "Student jest gotów do porozumiewania się w większości sytuacji życia codziennego i zawodowego bez przygotowania."}, "Technologie baz danych": {"": "Podgląd pdf", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U19_inz": "Absolwent potrafi budować proste systemy bazodanowe, wykorzystujące przynajmniej jeden z najbardziej popularnych systemów zarządzania bazą danych oraz posiada umiejętność utrzymywania systemów bazodanowych", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie szczegółowe zagadnienia projektowania i programowania relacyjnych baz danych", "W2": "Student zna i rozumie podstawowe zagadnienia w zakresie standardu SQL", "W3": "Student zna i rozumie podstawy metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie", "U1": "Student potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "U2": "Student potrafi budować proste systemy bazodanowe, wykorzystujące przynajmniej jeden z najbardziej popularnych systemów zarządzania bazą danych oraz posiada umiejętność utrzymywania systemów bazodanowych", "K1": "Student jest gotów do rozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Systemy operacyjne": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U14_inz": "Absolwent potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu.", "IN_K3_U23_inz": "Absolwent potrafi budować proste systemy wbudowane.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W1": "Student zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "W2": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "U1": "Student potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "U2": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "U3": "Student potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu.", "K1": "Student jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia."}, "Metody numeryczne": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie przyczyny błędów obliczeniowych i ich wpływu na dokładność obliczeń", "W2": "Student zna i rozumie podstawy matematyczne metod numerycznych stosowanych do wykonywania interpolacji i aproksymacji średniokwadratowej, rozwiązywania układów równań liniowych i nieliniowych, podstawowych rozkładów macierzy na iloczyny macierzy, wyznaczania wartości i wektorów własnych macierzy, całkowania numerycznego, rozwiązywania równań różniczkowych zwyczajnych", "U1": "Student potrafi rozwiązać prosty problem matematyczny w postaci algorytmu numerycznego", "U2": "Student potrafi rozróżnić podstawowe metody numeryczne ze względu na ich złożoność oraz precyzję obliczeniową", "U3": "Student potrafi zapisać prosty algorytm numeryczny w języku programu Python", "K1": "Student jest gotów do samodzielnego analizowania i rozwiązywania prostych zadań obliczeniowych"}, "Grafy i sieci": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "W1": "Student zna i rozumie podstawy teorii grafów, metody konstrukcji i analizy kosztu algorytmów grafowych", "U1": "Student potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli oraz innych działań w obszarze informatyki z użyciem algorytmów grafowych", "U2": "Student potrafi formułować algorytmy i je programować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych", "U3": "Student potrafi ocenić złożoność obliczeniową algorytmów i problemów, planować i przeprowadzać eksperymenty symulacyjne"}, "Ochrona własności intelektualnej": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie zagadnienia z zakresu ochrony własności intelektualnej, na co składa się rozumienie prawnych aspektów wykorzystywania wytworów ludzkiej inteligencji (prawo autorskie i prawa pokrewne, prawo własności przemysłowej)", "U1": "Student potrafi odszukać potrzebne informacje w zbiorach aktów prawnych oraz posiada umiejętności wykorzystania zdobytej wiedzy w praktyce", "K1": "Student jest gotów do praktycznego wykorzystania zdobytej wiedzy z zakresu ochrony własności intelektualnej oraz poszukiwania współpracy z ekspertami w przypadku trudności z samodzielnym rozwiązaniem problemu"}, "Metody analizy danych": {"": "Podgląd pdf", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zagadnienia praktyczne, w których stosowane są metody  porządkowania liniowego obiektów wielowymiarowych oraz zagadnienia dotyczące grupowania /klasyfikacji, rozumie podstawy teoretyczne wybranych metod analizy danych", "U1": "Student potrafi zastosować wybrane metody analizy danych,korzystając z pakietu R lub języka Python, wybrać właściwą metodę do analizy konkretnego problemu praktycznego", "K1": "Student jest gotów do stosowania wybranych wielowymiarowej analizy danych", "W2": "Student zna i rozumie zasady selekcji cech diagnostycznych, pozyskiwania i przekształcania danych, zna podstawowe techniki wizualizacji danych wielowymiarowych, uzupełniania braków danych i usuwania elementów odstających", "U2": "Student potrafi obsługiwać Excela/R/Pythona związanych z analizą danych, potrafi stosować właściwe metody uczenia maszynowego do wybranych problemów praktycznych", "K2": "Student jest gotów do pracy w zespole w roli lidera jak i członka zespołu"}, "Potwierdzenie B2 język obcy": {"": "Podgląd pdf", "IN_K3_U30": "Absolwent ma umiejęctności językowe w zakresie nauk technicznych, właściwych dla studiowanego kierunku studiów, zgodne z wymaganiami określonymi dla poziomu B2 Europejskiego Systemu Opisu Kształcenia Językowego.", "U1": "Student potrafi posługiwać się językiem obcym na poziomie B2"}, "Sieci komputerowe": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U15_inz": "Absolwent potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie zasady działania i podstawowe właściwości sieci komputerowych", "W2": "Student zna i rozumie podstawowe metody konfigurowania urządzeń aktywnych w sieciach komputerowych", "U1": "Student potrafi ocenić działania istniejących połączeń sieciowych", "U2": "Student potrafi tworzyć, konfigurować proste sieci LAN, WAN.", "K1": "Student jest gotów do współdziałania i pracy w zespole"}, "Techniki cyfrowe i podstawy systemów wbudowanych": {"": "Podgląd pdf", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie jak działają układy cyfrowe kombinacyjne i sekwencyjne (synchroniczne i asynchroniczne), pamięci półprzewodnikowe ROM i RAM, przetworniki analogowo-cyfrowe i cyfrowo -analogowe.", "U1": "Student potrafi projektować różnej klasy automaty cyfrowe  kombinacyjne i sekwencyjne.", "U2": "Student potrafi przeprowadzić minimalizację funkcji logicznej dla danego układu cyfrowego.", "U3": "Student potrafi określić i zniwelować niekorzystne zjawiska występujące podczas pracy automatu cyfrowego takie, jak hazard lub wyścig.", "K1": "Student jest gotów do pracy koncepcyjnej w zakresie układów cyfrowych zarówno indywidualnej, jak i w grupie."}, "Paradygmaty programowania": {"": "Podgląd pdf", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_U16_inz": "Absolwent potrafi zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W2": "Student zna i rozumie podstawowe paradygmaty algorytmiczne", "W1": "Student zna i rozumie metody budowania algorytmów przy pomocy różnych paradygmatów programowania", "W4": "Student zna i rozumie tematykę różnych paradygmatów programowania i języków programowania (imperatywny, obiektowy, funkcyjny, logiczny, skryptowy, maszyna wirtualna, podstawy translacji, deklaracje i typy, odśmiecanie, mechanizmy abstrakcji); szczegółowo zna metody projektowania i programowania obiektowego (kapsułkowanie i ukrywanie informacji, klasy i podklasy, dziedziczenie, polimorfizm, hierarchie klas)", "U4": "Student potrafi oceniać przydatność różnych paradygmatów i związanych z nimi środowisk programistycznych do rozwiązywania\r\nróżnego typu problemów", "K1": "Student jest gotów do pracy z zachowaniem uczciwości intelektualnej w działaniach własnych i innych osób; przestrzegania zasad etyki zawodowej i wymagania tego od innych oraz dbałości o dorobek i tradycje zawodu informatyka", "W3": "Student zna i rozumie ogólne zagadnienia w zakresie programowania, algorytmów i złożoności", "U1": "Student potrafi pozyskiwać informacje z literatury, baz wiedzy, Internetu oraz innych wiarygodnych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie", "U2": "Student potrafi pisać, uruchamiać i testować programy w wybranym środowisku programistycznym", "U3": "Student potrafi samodzielnie planować i realizować własne uczenie się przez całe życie", "U5": "Student potrafi stworzyć interpreter prostego języka programowania", "U6": "Student potrafi planować i organizować pracę indywidualnie i w zespole, także o charakterze interdyscyplinarnym; zarządzać swoim\r\nczasem oraz podejmować zobowiązania i dotrzymywać terminów", "K2": "Student jest gotów do uznawania znaczenia wiedzy w rozwiązywaniu problemów poznawczych i praktycznych oraz wyszukiwania informacji w literaturze oraz zasięgania opinii ekspertów"}, "Praktyki": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W13_inz": "Absolwent zna i rozumie podstawy w zakresie patentów, ustawy prawo autorskie i prawa pokrewne oraz ustawy o ochronie danych osobowych.", "IN_K3_W15_inz": "Absolwent zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_W17_inz": "Absolwent zna i rozumie zagadnienia z zakresu teoretycznych algorytmów, języków formalnych oraz ich powiązania z praktycznymi aspektami algorytmów i paradygmatów programowania.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_U27_inz": "Absolwent potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie zagadnienia informatyczne, będące przedmiotem zadań realizowanych w ramach praktyki; podstawowe techniki, metody oraz narzędzia informatyczne wykorzystywane podczas wykonywania zadań.", "U1": "Student potrafi we właściwy sposób diagnozować i rozwiązywać proste zadania informatyczne, wykorzystując różne narzędzia; analizować oraz oceniać przydatność systemów informatycznych, pochodzących z różnych działów przedsiębiorstwa i formułować na ich podstawie prawidłowe wnioski i decyzje; rozwijać umiejętności pracy w zespole; diagnozować i rozwiązywać problemy związane z wykonywaniem zawodu informatyka.", "K1": "Student jest gotów do dokształcania się i potrafi to czynić efektywnie; uzupełniania w miejscu pracy i doskonalenia nabytej wiedzy i umiejętności w sposób przedsiębiorczy; wykazywania się odpowiedzialnością za pracę własną i członków zespołu, wykazywania postawy etycznej w miejscu pracy, komunikowania się z osobami z różnych działów, organizacji i środowisk; prawidłowej identyfikacji i rozwiązywania dylematów związanych uprawianiem zawodu informatyka."}, "Dynamiczna analiza oprogramowania": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "W1": "Student zna i rozumie podstawowe pojęcia i koncepcje dynamicznej analizy oprogramowania.", "W2": "Student zna i rozumie najważniejsze techniki i narzędzi dynamicznej analizy oprogramowania.", "U1": "Student potrafi planować i przeprowadzać testy dynamiczne oraz interpretować ich wyniki.", "U2": "Student potrafi przeprowadzić proces debugowania oprogramowania, tj. analizowania i rozwiązywania problemów związanych z błędami i defektami."}, "Analiza statyczna oprogramowania": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W17_inz": "Absolwent zna i rozumie zagadnienia z zakresu teoretycznych algorytmów, języków formalnych oraz ich powiązania z praktycznymi aspektami algorytmów i paradygmatów programowania.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U20_inz": "Absolwent potrafi systematycznie przeprowadzać testy funkcjonalne, jest przygotowany do efektywnego uczestniczenia w inspekcji oprogramowania.", "IN_K3_U21_inz": "Absolwent potrafi efektywnie uczestniczyć w inspekcji oprogramowania.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_U27_inz": "Absolwent potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "W1": "Student zna i rozumie - idę analizy statycznej oprogramowania\r\n- reguły tworzenia testów statycznych\r\n-reguły tworzenia przeglądów kodu\r\n- narzędzia do automatycznej korekcji kodu dostępne w zintegrowanych środowiskach programistyczny\r\n- programy do analizy stycznej kodu pod kątem jego bezpieczeństwa\r\n- metodykę symbolicznego uruchamiania kodu", "U1": "Student potrafi - zdefiniować reguły i dobrać metryki testów statycznych i przeglądów\r\n- efektywnie wykorzystywać lintery dostępne w środowiskach IDE\r\n- przeprowadzić analizę statyczną kodu za pomocą popularnych tzw. holistycznych narzędzi \r\n- wykonać symboliczne uruchomienie kodu za pomocą narzędzia KLEE\r\n-wyciągnąć wnioski z przeprowadzonych testów i zastosować je w praktyce"}, "Architektura oprogramowania": {"": "Podgląd pdf", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W12_inz": "Absolwent zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_U12_inz": "Absolwent potrafi stworzyć model obiektowy prostego systemu (np. w języku UML).", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie techniki i narzędzia wspierające tworzenie architektury oprogramowania. Ma wiedzę z zakresu tworzenia architektury oprogramowania z wykorzystaniem atrybutów jakościowych.", "W2": "Student zna i rozumie wiedzę na temat cyklu biznesowego systemów informatycznych.", "U1": "Student potrafi dokonać analizy architektury oprogramowania systemu informatycznego w oparciu o dekompozycję modułową. Umie dokumentować architekturę oprogramowania. Umie oceniać architekturę istniejących systemów.", "U2": "Student potrafi zaprojektować model architektoniczny oprogramowania w oparciu o UML i dekompozycję modułową, refaktoryzować i modyfikować architektury prostych systemów.", "K1": "Student jest gotów do realizacji projektów programistyczno-wdrożeniowych w oparciu o zaprojektowaną architekturę"}, "Programowanie komponentowe": {"": "Podgląd pdf", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_U20_inz": "Absolwent potrafi systematycznie przeprowadzać testy funkcjonalne, jest przygotowany do efektywnego uczestniczenia w inspekcji oprogramowania.", "W1": "Student zna i rozumie specyfike programowania proceduralnego, obiektowego i komponentowego w wybranym języku programowania", "U1": "Student potrafi tworzyć programy z wykorzystaniem paradygmatów: proceduralnego, obiektowego i komponentowego, w tym projektować, wytwarzać, wdrażać i utrzymywać komponenty programowe, wykorzystując wybraną technologię komponentową", "W2": "Student zna i rozumie pojęcie komponentu programowego oraz ma wiedzę na temat podstaw tworzenia i wykorzystania wybranej technologii komponentowej", "U2": "Student potrafi projektować rozbudowane aplikacje z wykorzystaniem stworzonych samodzielnie obiektów i komponentów, w tym modułów wielokrotnego użycia, wykorzystując wybrany język programowania", "U3": "Student potrafi znajdować i niwelować zależności pomiędzy częściami oprogramowania"}, "Teoria algorytmów": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W17_inz": "Absolwent zna i rozumie zagadnienia z zakresu teoretycznych algorytmów, języków formalnych oraz ich powiązania z praktycznymi aspektami algorytmów i paradygmatów programowania.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "W1": "Student zna i rozumie ogólne zagadnienia z zakresu złożoności obliczeniowej problemów informatycznych oraz algorytmów wykorzystywanych do ich rozwiązania.", "U1": "Student potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia model, zapisu algorytmów i oraz innych działań w obszarze informatyki.", "W2": "Student zna i rozumie podstawy teoretyczne algorytmów, języków formalnych oraz ich powiązania z praktycznymi aspektami algorytmów i paradygmatów programowania.", "U2": "Student potrafi formułować algorytmy i je programować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "U3": "Student potrafi ocenić złożoność obliczeniową algorytmów i problemów."}, "Podstawy teleinformatyki": {"": "Podgląd pdf", "IN_K3_W02_inz": "Absolwent zna i rozumie podstawowe zagadnienia w zakresie fizyki obejmujące m. in. elektromagnetyzm, lasery, fizykę półprzewodników i fizyczne podstawy budowy komputerów kwantowych.", "IN_K3_W03_inz": "Absolwent zna i rozumie podstawy w zakresie elektrotechniki, pozwalające zrozumieć elektronikę oraz dokonywać pomiarów wielkości elektrycznych.", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie podstawy teorii sygnałów.", "W2": "Student zna i rozumie podstawy teorii informacji.", "W3": "Student zna i rozumie podstawy techniki światłowodowej.", "U1": "Student potrafi zaprojektować architekturę systemu transmisji danych między urządzeniami komputerowymi.", "K1": "Student jest gotów do pracy koncepcyjnej w zakresie przesyłania informacji z zastosowaniem technologii teleinformatycznych."}, "Systemy multimedialne": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U11": "Absolwent potrafi posługiwać się technikami informacyjno-komunikacyjnymi właściwymi do realizacji zadań typowych dla działalności inżynierskiej oraz potrafi przygotować dobrze udokumentowane opracowanie problemów z zakresu informatyki, potrafi efektywnie przetwarzać pliki tekstowe", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "W2": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "U1": "Student potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "U2": "Student potrafi posługiwać się technikami informacyjno-komunikacyjnymi właściwymi do realizacji zadań typowych dla działalności inżynierskiej oraz potrafi przygotować dobrze udokumentowane opracowanie problemów z zakresu informatyki, potrafi efektywnie przetwarzać pliki tekstowe", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Podstawy fotografii cyfrowej": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie zagadnienia z zakresu  grafiki i komunikacji człowiek-komputer. Rozumie zasady powstawania obrazu cyfrowego, zna podstawowe formaty jego zapisu.", "U2": "Student potrafi podczas pozyskiwania danych w postaci obrazu postrzegać związane z tym aspekty społeczne, ekonomiczne i prawne.", "W2": "Student zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy obrazu.", "K1": "Student jest gotów do wykazania się skutecznością w realizacji projektów pozyskiwania obrazów cyfrowych w wielu kategoriach.", "U1": "Student potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań z zakresu pozyskiwania danych w postaci obrazu. Potrafi metodami analitycznymi ocenić jakość danych w postaci obrazu, a także ją zmodyfikować."}, "Wirtualizacja i Konteneryzacja": {"": "Podgląd pdf", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu wirtualizacji i konteneryzacji", "W2": "Student zna i rozumie podstawy w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych oraz wirtualizacji i konteneryzacji.", "U1": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski, szczególnie w zakresie wirtualizacji i konteneryzacji", "U2": "Student potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Usługi Devops (CKA)": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W15_inz": "Absolwent zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U14_inz": "Absolwent potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie zagadnienia: DevOps, potoki wdrożeń, procesy ciągłego wdrażania, dostarczania oraz integracji oprogramowania.", "W2": "Student zna i rozumie metody i narzędzia automatyzacji w procesach wytwarzania.", "U1": "Student potrafi zautomatyzować procesy wytwórcze, zaprojektować potok wdrożeń dla realizowanej aplikacji oraz wykorzystać narzędzia jej monitorowania.", "K1": "Student jest gotów do kształtowania postawy współpracy w zespole i świadomego wpływu na jakość wytwarzanego projektu."}, "Grafika komputerowa i komunikacja z komputerem": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "U3": "Student potrafi definiować wymagania stawiane specjalistycznym interfejsom komputerowym (zwłaszcza graficznym) i oceniać jakość zrealizowanych rozwiązań.", "K1": "Student jest gotów do monitorowania postępu w zakresie technik i algorytmów wykorzystywanych w grafice komputerowej, przetwarzaniu obrazów i tworzenie interfejsów komputerowych.", "W1": "Student zna i rozumie teoretyczne podstawy grafiki komputerowej i komunikacji człowiek-komputer.", "U2": "Student potrafi ocenić ocenić złożoność  obliczeniową algorytmów i problemów z zakresu grafiki komputerowej i przetwarzania obrazów.", "W2": "Student zna i rozumie podstawowe metody, algorytmy i narzędzia stosowane przy rozwiązywaniu zadań informatycznych z zakresu  grafiki komputerowej i przetwarzania obrazów.", "U1": "Student potrafi wykorzystać nabytą wiedzę teoretyczną do zapisu algorytmów oraz innych działań w obszarach grafiki komputerowej, przetwarzania obrazów i projektowania interfejsów graficznych.", "W3": "Student zna i rozumie wytyczne i zasady tworzenia interfejsów (zwłaszcza graficznych) człowiek-komputer."}, "Projekt zespołowy": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "W2": "Student zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "U1": "Student potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "U2": "Student potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej"}, "Problemy społeczne i zawodowe informatyki": {"": "Podgląd pdf", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_W13_inz": "Absolwent zna i rozumie podstawy w zakresie patentów, ustawy prawo autorskie i prawa pokrewne oraz ustawy o ochronie danych osobowych.", "IN_K3_W14_inz": "Absolwent zna i rozumie podstawy w zakresie prowadzenia działalności gospodarczej i zarządzania nią.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W3": "Student zna i rozumie podstawowy zakres wiedzy dotyczącej prowadzenia działalności gospodarczej i zarządzania nią.", "U1": "Student potrafi dostrzegać aspekty społeczne, ekonomiczne i prawne przy formułowaniu i rozwiązywaniu zadań informatycznych", "W2": "Student zna i rozumie podstawowy zakres wiedzy dotyczącej ustawy o ochronie danych osobowych.", "W1": "Student zna i rozumie podstawowy zakres wiedzy dotyczącej kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo.", "K1": "Student jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości."}, "Seminarium dyplomowe": {"": "Podgląd pdf", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "W1": "Student zna i rozumie zasady klarownego, czytelnego przedstawiania koncepcji, projektów i rozwiązań, prowadzenia samodzielnych prac i wyciągania wniosków z ich wyników.", "U1": "Student potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "U3": "Student potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej. Potrafi prawidłowo wyciągać wnioski na temat zadań zrealizowanych podczas pracy nad rozprawą.", "K1": "Student jest gotów do zrozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "K2": "Student jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami. Takim projektem jest praca programistyczna przygotowująca dane do rozprawy oraz sama rozprawa dyplomowa.", "U2": "Student potrafi posługiwać się technikami informacyjno-komunikacyjnymi właściwymi do realizacji zadań typowych dla działalności inżynierskiej oraz potrafi przygotować dobrze udokumentowane opracowanie problemów z zakresu informatyki, stosując się do podstawowych zasad obowiązujących w publikacjach technicznych i naukowych. Potrafi efektywnie przetwarzać pliki tekstowe.", "K3": "Student jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały. Jest do tego przygotowywany poprzez przygotowanie i przedstawienie referatu na temat swojej rozprawy."}, "Testy penetracyjne": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie podstawy w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "W2": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "U1": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "U2": "Student potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Audyt bezpieczeństwa": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zagadnienia :zasoby, podatności, zagrożenia, matryca kontroli działania systemu, analiza ryzyka, audyt bezpieczeństwa dla systemów informacyjnych.", "U1": "Student potrafi interpretować wyniki analizy ryzyka i/lub audytu bezpieczeństwa, przygotować raport końcowy z analizy lub audytu wraz z zaleceniami (np. zmian w polityce bezpieczeństwa, wdrożenia nowych zabezpieczeń, opracowania planu ciągłości działania - BCP dla dowolnego systemu IT.", "K1": "Student jest gotów do pracy w zespole, zna zasady etyki zawodowej"}, "Bezpieczeństwo sieci": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_U11": "Absolwent potrafi posługiwać się technikami informacyjno-komunikacyjnymi właściwymi do realizacji zadań typowych dla działalności inżynierskiej oraz potrafi przygotować dobrze udokumentowane opracowanie problemów z zakresu informatyki, potrafi efektywnie przetwarzać pliki tekstowe", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zasady i metody zabezpieczeń sieci komputerowych w warstwie sieci", "W2": "Student zna i rozumie zasady i metody zabezpieczeń  sieć z wykorzystaniem urządzeń ASA", "U1": "Student potrafi skonfigurować szyfrowane połączenia dla sieci LAN typu site-to-site", "U2": "Student potrafi konfigurować i wykrywać włamania do sieci w oparciu o system IPS oraz sygnatury", "K1": "Student jest gotów do współdziałania i pracy w zespole"}, "Projektowanie bezpiecznych aplikacji": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie podstawowe wymagania dot. tworzenia profili zabezpieczeń, zna zasady projektowania, implementacji i testowania oraz oceny dowolnej aplikacji pod względem zgodności z wymaganiami norm.", "U1": "Student potrafi ocenić profil zabezpieczeń/zadania zabezpieczeń aplikacji, generować raporty z ocenę i wskazać najlepszych rozwiązań zgodnie z wytycznymi norm.", "K1": "Student jest gotów do pracy w zespole, zna zasady etyki zawodowej"}, "Ochrona informacji i bezpieczeństwo systemów komputerowych": {"": "Podgląd pdf", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U15_inz": "Absolwent potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "IN_K3_U16_inz": "Absolwent potrafi zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie jak identyfikować typowe podatności i zagrożenia występujące w systemach informacyjnych, zna podstawowe mechanizmy ochrony informacji, w tym metody kryptograficzne, mechanizmy uwierzytelnienia, metody kontroli dostępu, protokoły wymiany informacji itp.", "U1": "Student potrafi analizować typowe podatności i zagrożenia występujące w systemach informacyjnych, potrafi sformułować wymagania bezpieczeństwa, dobierać mechanizmy zabezpieczeń na poziomie aplikacji, systemów operacyjnych i sieci.", "K1": "Student jest gotów do pracy w zespole, zna zasady  etyki zawodowej"}, "Programowanie w Internecie": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_U27_inz": "Absolwent potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W1": "Student zna i rozumie działanie technologii klient-serwer", "W2": "Student zna i rozumie pojęcie technologii klienckiej", "W5": "Student zna i rozumie podstawy praw i ograniczeń związanych z tworzeniem aplikacji webowych", "K1": "Student jest gotów do oceny i weryfikacji potrzeby i przydatności poszczególnych elementów przygotowanej strony internetowej w stosunku do ich zastosowania", "W3": "Student zna i rozumie podstawowe frameworki używane po stronie aplikacji (Server side)", "U1": "Student potrafi zbudować szkielet strony WWW", "U2": "Student potrafi zaprojektować oraz zaimplementować układy stron", "U3": "Student potrafi dodać do strony kaskadowe arkusze stylów", "U4": "Student potrafi posługiwać się językiem JavaScript", "W4": "Student zna i rozumie zna podstawy technologii ASP.NET i MVC .NET", "U5": "Student potrafi określić kierunek rozwoju technologii oraz wyszukiwać najnowszą wiedzę z zakresu budowy aplikacji webowych"}, "Systemy przetwarzania danych": {"": "Podgląd pdf", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U19_inz": "Absolwent potrafi budować proste systemy bazodanowe, wykorzystujące przynajmniej jeden z najbardziej popularnych systemów zarządzania bazą danych oraz posiada umiejętność utrzymywania systemów bazodanowych", "W1": "Student zna i rozumie budowę współczesnego systemu przetwarzania danych", "W2": "Student zna i rozumie poszczególne transformacje danych", "U1": "Student potrafi korzystać z Integration Services na poziomie użytkownika", "U2": "Student potrafi zastosować sposoby konfigurowania, zabezpieczania i cyklicznego uruchamiania pakietów"}, "Hurtownie danych": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "W1": "Student zna i rozumie zagadnienia w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych", "W2": "Student zna i rozumie temat algorytmiki oraz projektowania i programowania w MDX", "W3": "Student zna i rozumie zagadnienia standardów w informatyce.", "W4": "Student zna i rozumie związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin", "U1": "Student potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych", "U2": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski"}, "Systemy wbudowane": {"": "Podgląd pdf", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_W03_inz": "Absolwent zna i rozumie podstawy w zakresie elektrotechniki, pozwalające zrozumieć elektronikę oraz dokonywać pomiarów wielkości elektrycznych.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U13_inz": "Absolwent potrafi ocenić złożoność obliczeniową algorytmów i problemów.", "IN_K3_U23_inz": "Absolwent potrafi budować proste systemy wbudowane.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie budowę mikrokontrolera, potrafi podać jego elementy oraz przykłady oraz klasyfikację", "W3": "Student zna i rozumie operacje wykonywane w systemie wbudowanym, rozumie ich znaczenie", "W4": "Student zna i rozumie metody komunikacji między modułami systemów cyfrowych", "W2": "Student zna i rozumie specyficzne cechy systemów pomiarowo-kontrolnych", "U1": "Student potrafi opracować program dla systemu wbudowanego, z wykorzystaniem języków niskiego i wysokiego poziomu,", "K1": "Student jest gotów do współpracy w grupie", "U3": "Student potrafi zdiagnozować wady systemu wbudowanego", "U2": "Student potrafi zaimplementować różne algorytmy w asemblerze dedykowanym DSM8051"}, "Systemy rozproszone": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U16_inz": "Absolwent potrafi zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W1": "Student zna i rozumie budowę systemu rozproszonego, potrafi podać jego elementy i klasyfikację.", "W2": "Student zna i rozumie specyficzne cechy systemu rozproszonego.", "W3": "Student zna i rozumie operacje wykonywane w systemie rozproszonym, rozumie ich znaczenie.", "U1": "Student potrafi zaimplementować i zastosować różnorodne narzędzia komunikacji w systemie rozproszonym.", "W4": "Student zna i rozumie zasady programowania w języku wykonywanym na pośredniej warstwie oprogramowania.", "U2": "Student potrafi zabezpieczyć system rozproszony, zapewnić uwierzytelnienie i autoryzację.", "K1": "Student jest gotów do zrozumienia zagadnień społecznych, etycznych i prawnych związanych z wykorzystaniem systemów rozproszonych, a zwłaszcza chmur obliczeniowych."}, "Usługi sieciowe": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W15_inz": "Absolwent zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "IN_K3_U14_inz": "Absolwent potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu.", "IN_K3_U15_inz": "Absolwent potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "IN_K3_U16_inz": "Absolwent potrafi zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "IN_K3_U27_inz": "Absolwent potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie podstawy w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych oraz w zakresie standardów i norm technicznych w informatyce.", "W2": "Student zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "U1": "Student potrafi posługiwać się systemami operacyjnymi na poziomie API oraz z pozycji administratora systemu, projektować proste sieci komputerowe. Potrafi także pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać, a także zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "U2": "Student potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych, w tym wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "K1": "Student jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych oraz do profesjonalnego zachowania."}, "Bezpieczeństwo sprzętowe": {"": "Podgląd pdf", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "W2": "Student zna i rozumie podstawy w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "U1": "Student potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "U2": "Student potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Podstawy przetwarzania dźwięku": {"": "Podgląd pdf", "IN_K3_W02_inz": "Absolwent zna i rozumie podstawowe zagadnienia w zakresie fizyki obejmujące m. in. elektromagnetyzm, lasery, fizykę półprzewodników i fizyczne podstawy budowy komputerów kwantowych.", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie falę akustyczną i jej propagację w różnych warunkach.", "W2": "Student zna i rozumie działanie przetworników elektroakustycznych oraz innych elementów toru audio.", "W3": "Student zna i rozumie zagrożenia związane z hałasem oraz zna normy dotyczące pomiarów pomiarów środowiskowych", "U1": "Student potrafi prawidłowo wykonać i interpretować podstawowe pomiary akustyczne.", "U2": "Student potrafi napisać program obsługujące interfejsy audio (w szerokim tego słowa znaczeniu).", "U3": "Student potrafi wykorzystać różnego rodzaju oprogramowanie związane z przetwarzaniem dźwięku", "K1": "Student jest gotów do analizy zagrożeń związanych z hałasem oraz jest gotów do przekazywania tej wiedzy w swoim środowisku."}, "Wizualizacja danych": {"": "Podgląd pdf", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "W1": "Student zna i rozumie zasady przetwarzania i analizy danych prezentowanych wizualnie oraz wyciągania wniosków na tej podstawie.", "K1": "Student jest gotów do wsparcia przekazywanej informacji w formie wizualnej w sposób powszechnie zrozumiały.", "U1": "Student potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, oraz innych działań w obszarze informatyki dla zrealizowania wizualizacji przetwarzanych danych, pokazania w formie graficznej relacji zachodzących między danymi, trendów i odstępstw od nich.", "U2": "Student potrafi wykorzystać do przygotowania danych w odpowiednich formatach podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe. Potrafi zasymulować mechanizmy rządzące zjawiskami i przedstawić ich wyniki w postaci wizualnej.", "U3": "Student potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań wizualizacji danych."}, "Symulacja komputerowa": {"": "Podgląd pdf", "IN_K3_W01_inz": "Absolwent zna i rozumie zagadnienia z matematyki - obejmujące analizę matematyczną, algebrę, matematykę dyskretną, metody probabilistyczne, statystykę i metody numeryczne - przydatne do formułowania i rozwiązywania prostych zadań związanych z informatyką.", "IN_K3_W02_inz": "Absolwent zna i rozumie podstawowe zagadnienia w zakresie fizyki obejmujące m. in. elektromagnetyzm, lasery, fizykę półprzewodników i fizyczne podstawy budowy komputerów kwantowych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "W1": "Student zna i rozumie odpowiednie zagadnienia z zakresu matematyki i informatyki, które umożliwiają mu opisywanie wybranych zjawisk za pomocą matematycznych modeli rzeczywistości.", "W2": "Student zna i rozumie podstawowe zagadnienia w zakresie fizyki, chemii, biologii, meteorologii, astronomii, nauk społecznych, która umożliwiają zaproponowanie odpowiedniego modelu matematycznego do opisu wybranego zagadnienia.", "W3": "Student zna i rozumie różne metody i techniki symulacji komputerowych.", "U1": "Student potrafi skutecznie wykorzystać swoją wiedzę, wyobraźnię i intuicję do projektowania symulacji komputerowych", "U2": "Student potrafi efektywnie wykorzystać swoją nabytą wiedzę do analizy poprawności modelu symulacji i do analizy wykonanych symulacji komputerowych", "U3": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne oraz student potrafi prawidłowo interpretować otrzymane wyniki symulacji.", "U4": "Student potrafi projektować i tworzyć odpowiednie i dobrze zoptymalizowane algorytmy do wykonywania symulacji komputerowych."}, "Aplikacje internetowe": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U12_inz": "Absolwent potrafi stworzyć model obiektowy prostego systemu (np. w języku UML).", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie podstawy w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "W2": "Student zna i rozumie podstawy cyklu życia systemów informatycznych.", "U1": "Student potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "U2": "Student potrafi stworzyć model obiektowy prostego systemu (np. w języku UML).", "K1": "Student jest gotów do pracy zespołowej."}, "Uczenie maszynowe w chmurze": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie ogólne zagadnienia w zakresie modeli uczenia maszynowego w rozwiązaniach chmurowych.", "W2": "Student zna i rozumie wybrane zagadnienia z zakresu informatyki, takie jak: uczenie maszynowe, sztuczne sieci neuronowe, uczenie reprezentacji, inżynieria cech.", "W3": "Student zna i rozumie procesy zachodzące w cyklu życia systemów informatycznych sprzętowych lub programowych stosowanych do rozwiązywania wybranych zadań charakterystycznych dla uczenia maszynowego w zastosowaniach chmurowych.", "W4": "Student zna i rozumie zaawansowane metody, techniki i narzędzia stosowane przy rozwiązywaniu złożonych zadań inżynierskich oraz przy prowadzeniu prac badawczych typowych dla klasyfikacji, regresji, inżynierii cech z wykorzystaniem uczenia maszynowego w chmurze.", "U1": "Student potrafi zaprojektować oraz uruchomić usługi w chmurze według założonych wymagań.", "U2": "Student potrafi zaimplementować algorytmy w oparciu o wybrane pakiety Pythona (np. NumPy, Pandas, Scikit-Learn) w tym również w środowiskach SaaS z wykorzystaniem pamięci obiektowej.", "K1": "Student jest gotów do zrozumienia znaczenia wykorzystywania najnowszej wiedzy z zakresu uczenia uczenia maszynowego w rozwiązywaniu problemów badawczych i praktycznych.", "U3": "Student potrafi zastosować podstawowe terminy i mechanizmy związane z cyberbezpieczeństwem.", "U4": "Student potrafi zarządzać cyklem życia oprogramowania we współpracy z innymi uczestnikami projektu."}, "Deep learning w chmurze": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie modele uczenia głębokiego w chmurze obliczeniowej, w tym zwłaszcza sieci neuronowych.", "W2": "Student zna i rozumie wybrane zagadnienia z zakresu uczenia głębokiego oraz reprezentacji i inżynierii cech Big Data.", "W3": "Student zna i rozumie procesy zachodzące w cyklu życia systemów informatycznych sprzętowych lub programowych, stosowanych do rozwiązywania wybranych zadań charakterystycznych dla uczenia głębokiego w chmurze.", "W4": "Student zna i rozumie zaawansowane metody, techniki i narzędzia stosowane przy rozwiązywaniu złożonych zadań inżynierskich oraz przy prowadzeniu prac badawczych typowych dla klasyfikacji, regresji, inżynierii cech z wykorzystaniem uczenia głębokiego w chmurze.", "U1": "Student potrafi formułować i testować hipotezy związane z problemami rozwiązywanymi przy pomocy modeli uczenia głębokiego i prostymi problemami badawczymi charakterystycznymi dla tego obszaru sztucznej inteligencji z wykorzystaniem platform chmur obliczeniowych.", "U2": "Student potrafi wykorzystać metody eksperymentalne do formułowania i rozwiązywania zadań w obszarze zastosowań uczenia głębokiego, zwłaszcza głębokich sieci neuronowych, oraz prostych problemów badawczych.", "U3": "Student potrafi integrować wiedzę z różnych obszarów informatyki (a w razie potrzeby także wiedzę z innych dyscyplin naukowych) przy formułowaniu i rozwiązywaniu typowych dla uczenia głębokiego i sieci neuronowych.", "U4": "Student potrafi ocenić przydatność i możliwość wykorzystania nowych osiągnięć dotyczących uczenia głębokiego oraz powiązanych zagadnień i technik sztucznej inteligencji.", "U5": "Student potrafi zaproponować ulepszenia (usprawnienia) istniejących rozwiązań technicznych w obszarze uczenia głębokiego, w szczególności w oparciu o istniejące biblioteki i środowiska programistyczne takie jak TensorFlow i PyTorch.", "U6": "Student potrafi rozwiązywać złożone zadania typowe dla uczenia głębokiego, w tym zadania nietypowe oraz zadania zawierające komponent badawczy, np. zaawansowane uczenie reprezentacji i/lub inżynierię cech.", "K1": "Student jest gotów do wykorzystywania najnowszej wiedzy z zakresu uczenia głębokiego, sieci neuronowych i powiązanych podejść uczenia maszynowego i\tsztucznej inteligencji w rozwiązywaniu problemów badawczych i praktycznych."}, "Bezpieczeństwo usług chmurowych": {"": "Podgląd pdf", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U15_inz": "Absolwent potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "IN_K3_U27_inz": "Absolwent potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "W2": "Student zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "U1": "Student potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "U2": "Student potrafi ocenić, na podstawowym poziomie, przydatność rutynowych metod i narzędzi informatycznych oraz wybrać i zastosować właściwą metodę i narzędzia do typowych zadań informatycznych.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Programowanie w chmurze (CKAD)": {"": "Podgląd pdf", "IN_K3_W08_inz": "Absolwent zna i rozumie podstawy  cyklu życia systemów informatycznych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie podstawy cyklu życia systemów informatycznych związku w wdrożeniem za pomocą Kubernetes", "W2": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu kubernetes", "U1": "Student potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi typu kubernetes", "U2": "Student potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej."}, "Sztuczna inteligencja": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W09_inz": "Absolwent zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu analizy złożoności obliczeniowej algorytmów, budowy systemów komputerowych, systemów operacyjnych, sieci komputerowych, implementacji języków programowania, grafiki komputerowej, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zagadnienia ogólne w zakresie struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do  języków i paradygmatów programowania i sztucznej inteligencji", "W2": "Student zna i rozumie podstawowe metody, techniki i narzędzia stosowane przy rozwiązywaniu prostych zadań informatycznych z zakresu sztucznej inteligencji.", "W3": "Student zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "U1": "Student potrafi formułować algorytmy i je programować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "U2": "Student potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "K1": "Student jest gotów do pracy zespołowej."}, "Komunikacja międzykulturowa": {"": "Podgląd pdf", "IN_K3_W12_inz": "Absolwent zna i rozumie podstawowe pojęcia z zakresu ekonomii odnoszące się do inwestycji informatycznych i projektów informatycznych, takie jak zwrot z inwestycji, koszty stałe i koszty zmienne, ryzyko finansowe, przychód a zysk, zysk a przepływy pieniężne (ang. cash flow).", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "W1": "Student zna i rozumie podstawowe pojęcia z zakresu komunikacji międzykulturowej", "W2": "Student zna i rozumie wpływ czynników kulturowych na przebieg i charakter komunikacji", "U1": "Student potrafi samodzielnie zdobywać wiedzę i rozwijać myślenie krytyczne", "K1": "Student jest gotów do diagnozowania przyczyn konfliktów kulturowych i zapobiegania im"}, "Cyberterroryzm, wojny hybrydowe i międzynarodowe zagrożenia cyberbezpieczeństwa": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_U26_inz": "Absolwent potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie zagrożenia cyberterroryzmem, zagrożenia związane z wojną hybrydową oraz międzynarodowe zagrożenia cyberbezpieczeństwa.", "W2": "Student zna i rozumie obszary zagrożeń cyberterrorystycznych, wojna hybrydową oraz międzynarodowe zagrożenia cyberbezpieczeństwa.", "U1": "Student potrafi wskazać przykłady zakłócenia zorganizowanego obiegu informacji w cyberprzestrzeni, jak działania hakerskie i inne, mające na celu wywołanie strachu, szantaż społeczny lub szantaż rządowy.", "U2": "Student potrafi rozróżnić formy i działania stosowane przez cyberterrorystów.", "K1": "Student jest gotów do dalszego dokształcania się. Student zwraca szczególną uwagę na problemy bezpieczeństwa systemów informatycznych oraz na edukację osób decydujących o bezpieczeństwie teleinformatycznym.."}, "Systemy Business Intelligence": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U08_inz": "Absolwent potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "IN_K3_U28_inz": "Absolwent potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "W1": "Student zna i rozumie standardy i normy techniczne w informatyce, w tym również dot. architektury systemów BI.  Zna cele i zadania stawiane systemom Business Intelligence oraz rozumie potrzebę budowy systemów klasy BI", "W2": "Student zna i rozumie metody gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciąganie wniosków na tej podstawie.  Posiada wiedzę dot. algorytmów data mining wykorzystywanych do wspomagania decyzji w systemach Business Intelligence", "U1": "Student potrafi wykorzystać do formułowania i rozwiązywania zadań informatycznych podstawowe metody analityczne i eksperymentalne, w tym proste eksperymenty obliczeniowe.", "U2": "Student potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi.", "U3": "Student potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych  w takich obszarach jak pobieranie danych z systemów źródłowych, dokonywanie przekształceń na danych, agregacji, dostarczanie informacji w formie kostek OLAP lub gotowych zestawień/raportów.", "K1": "Student jest gotów do pracy zespołowej."}, "Systemy handlu elektronicznego": {"": "Podgląd pdf", "IN_K3_W13_inz": "Absolwent zna i rozumie podstawy w zakresie patentów, ustawy prawo autorskie i prawa pokrewne oraz ustawy o ochronie danych osobowych.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_U17_inz": "Absolwent potrafi tworzyć proste aplikacje internetowe.", "IN_K3_U18_inz": "Absolwent potrafi  zaprojektować ergonomiczny interfejs użytkownika dla aplikacji internetowych.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie aspekty prawne związane z działalnością handlową w internecie.", "U1": "Student potrafi stworzyć rozwiązanie e-commerce które jest zgodne z zasadami psychologii sprzedaży.", "U2": "Student potrafi stworzyć rozwiązanie e-commerce w oparciu o środowisko open-source zintegrowane z zewnętrznymi partnerami np. logistycznymi.", "K1": "Student jest gotów do poszerzania swojej wiedzy i kompetencji w dynamicznie zmieniającym się środowisku e-commerce."}, "Systemy mobilne i komunikacja bezprzewodowa": {"": "Podgląd pdf", "IN_K3_W05_inz": "Absolwent zna i rozumie podstawy  w zakresie telekomunikacji, potrzebną do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych.", "IN_K3_W04_inz": "Absolwent zna i rozumie elementarne zagadnienia w zakresie elektroniki, potrzebne do zrozumienia techniki analogowej i cyfrowej, układów logicznych oraz zasad funkcjonowania współczesnych komputerów.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U02_inz": "Absolwent potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać wiedzę do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U07_inz": "Absolwent potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski.", "IN_K3_U10_inz": "Absolwent potrafi formułować algorytmy i je implementować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych.", "IN_K3_U15_inz": "Absolwent potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "IN_K3_U06": "Absolwent potrafi posługiwać się językiem angielskim w stopniu pozwalającym na porozumienie się, przeczytanie ze zrozumieniem tekstów i dokumentacji oprogramowania.", "IN_K3_U05": "Absolwent potrafi porozumiewać się przy użyciu różnych technik w środowisku zawodowym oraz w innych środowiskach, także z wykorzystaniem narzędzi informatycznych.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "IN_K3_K02": "Absolwent jest gotów do zozumienia potrzeby i poznania możliwości dalszego dokształcania się (studia II i III stopnia, studia podyplomowe, kursy i egzaminy przeprowadzane przez uczelnie, firmy i organizacje zawodowe).", "U1": "Student potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki", "U3": "Student potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań", "K2": "Student jest gotów do zrozumienia znaczenia najnowszej wiedzy z zakresu systemów mobilnych i bezprzewodowych, w rozwiązywaniu problemów badawczych i praktycznych", "K3": "Student jest gotów do zrozumienia, że w informatyce, a zwłaszcza w nowoczesnych systemach mobilnych, wiedza, technologie i umiejętności bardzo szybko stają się przestarzałe", "W2": "Student zna i rozumie podstawowe zagadnienia w zakresie telekomunikacji, potrzebne do zrozumienia zasad działania współczesnych sieci komputerowych, w tym sieci bezprzewodowych", "U4": "Student potrafi planować i przeprowadzać eksperymenty symulacyjne i praktyczne oraz interpretować uzyskane wyniki i wyciągać wnioski", "U7": "Student potrafi wdrażać techniki komputerowe w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi", "U2": "Student potrafi wykorzystać wiedzę matematyczną do optymalizacji rozwiązań sprzętowych i programowych; potrafi wykorzystać do formułowania i rozwiązywania zadań informatycznych metody analityczne i eksperymentalne", "U5": "Student potrafi formułować algorytmy i je programować z użyciem przynajmniej jednego z popularnych narzędzi i środowisk projektowych", "W1": "Student zna i rozumie zasady projektowania prostych sieci komputerowych; wymagania funkcji administratora sieci komputerowej oraz utrzymania sieci", "K1": "Student jest gotów do dostrzegania aspektów społecznych, ekonomicznych i prawnych przy formułowaniu i rozwiązywaniu zadań informatycznych.", "U6": "Student potrafi projektować proste sieci komputerowe; potrafi pełnić funkcję administratora sieci komputerowej oraz ją utrzymywać", "U8": "Student potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych"}, "Bezpieczeństwo systemów komputerowych": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W11_inz": "Absolwent zna i rozumie podstawy w zakresie kodeksów etycznych informatyki, zna zasady netykiety, rozumie zagrożenia związane z przestępczością elektroniczną oraz specyfikę systemów krytycznych ze względu na bezpieczeństwo (ang. mission-critical systems).", "IN_K3_U16_inz": "Absolwent potrafi zabezpieczyć przesyłane dane przed nieuprawnionym odczytem.", "IN_K3_U24_inz": "Absolwent potrafi  wykorzystać zasady, normy i standardy bezpieczeństwa związane z pracą w środowisku przemysłowym.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "W1": "Student zna i rozumie podstawowe metody i mechanizmy zapewnienia bezpieczeństwa systemów komputerowych", "W2": "Student zna i rozumie podstawowe elementy kryptografii stosowane w bezpieczeństwie systemów komputerowych", "U1": "Student potrafi dokonać oceny mechanizmów bezpieczeństwa systemów i sieci komputerowych", "U2": "Student potrafi konfigurować mechanizmy bezpieczeństwa w systemach komputerowych", "K1": "Student jest gotów do współdziałania i pracy w zespole"}, "Cyfrowe przetwarzanie obrazu": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "IN_K3_K01": "Absolwent jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych; jest przygotowany do nieustannego poszerzania swojej wiedzy i umiejętności w ramach pracy zawodowej.", "W1": "Student zna i rozumie metody przekształcania i filtrowania obrazów cyfrowych", "W2": "Student zna i rozumie podstawowe metody pozyskiwania obrazów cyfrowych", "U1": "Student potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "K1": "Student jest gotów do zrozumienia szybkości procesu zachodzenia zmian w technikach komputerowych"}, "Animacja komputerowa": {"": "Podgląd pdf", "IN_K3_W06_inz": "Absolwent zna i rozumie zagadnienia z zakresu struktur danych, złożoności obliczeniowej problemów obliczeniowych oraz algorytmów wykorzystywanych do ich rozwiązywania, architektury systemów komputerowych, systemów operacyjnych, technologii sieciowych, języków i paradygmatów programowania, grafiki i komunikacji człowiek-komputer, sztucznej inteligencji, baz danych, inżynierii oprogramowania oraz systemów wbudowanych.", "IN_K3_W07_inz": "Absolwent zna i rozumie szczegółowe zagadnienia z zakresu algorytmiki oraz projektowania i programowania obiektowego.", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U29_inz": "Absolwent potrafi posługiwać się specjalistycznym oprogramowaniem użytkowym lub projektowym do rozwiązywania praktycznych zadań i problemów informatycznych.", "W2": "Student zna i rozumie zasady pracy z silnikiem we współczesnych środowiskach do tworzenia grafiki komputerowej", "W3": "Student zna i rozumie współczesne trendy rozwojowe w animacji komputerowej", "W1": "Student zna i rozumie podstawowe techniki animacji fizyki ruchu, możliwe do zastosowania w dowolnym środowisku przeznaczonym do tworzenia i animacji grafiki trój- i dwuwymiarowej", "U1": "Student potrafi programować w wybranym języku obiektowym wykorzystywanym przy tworzeniu animacji.", "U2": "Student potrafi przygotować pełną animację komputerową w wybranym środowisku zgodnie ze współczesnymi trendami"}, "Metody Data Mining": {"": "Podgląd pdf", "IN_K3_W16_inz": "Absolwent zna i rozumie  związki pomiędzy technikami komputerowymi oraz naukami przyrodniczymi, potrafi rozpoznać typowe problemy na styku informatyki oraz innych dziedzin.", "IN_K3_W18_inz": "Absolwent zna i rozumie podstawy w zakresie metod gromadzenia, przetwarzania i analizy danych (bez względu na ich pochodzenie) oraz wyciągania wniosków na tej podstawie.", "IN_K3_U01_inz": "Absolwent potrafi wykorzystać nabytą wiedzę matematyczną do opisu procesów, tworzenia modeli, zapisu algorytmów oraz innych działań w obszarze informatyki.", "IN_K3_U09_inz": "Absolwent potrafi – przy formułowaniu i rozwiązywaniu zadań informatycznych – dostrzegać ich aspekty społeczne, ekonomiczne i prawne.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "IN_K3_K07": "Absolwent jest gotów do przekazania informacji o osiągnięciach informatyki i różnych aspektach zawodu informatyka w sposób powszechnie zrozumiały.", "W1": "Student zna i rozumie zagadnienia algorytmiki oraz projektowania i programowania obiektowego", "W2": "Student zna i rozumie metody zarządzania złożonymi przedsięwzięciami informatycznymi", "U1": "Student potrafi budować proste systemy bazodanowe, wykorzystujące przynajmniej jeden z najbardziej popularnych systemów zarządzania bazą danych oraz posiada umiejętność utrzymywania systemów bazodanowych", "U2": "Student potrafi wykonać prostą analizę sposobu funkcjonowania systemu informatycznego i ocenić istniejące rozwiązania informatyczne, przynajmniej w odniesieniu do ich cech funkcjonalnych oraz norm i standardów informatycznych", "K1": "Student jest gotów do wdrażania technik komputerowych w dziedzinach wymagających ich wsparcia, używając właściwych metod i narzędzi"}, "Komercjalizacja wiedzy w IT": {"": "Podgląd pdf", "IN_K3_W10_inz": "Absolwent zna i rozumie podstawy w zakresie standardów i norm technicznych w informatyce.", "IN_K3_W15_inz": "Absolwent zna i rozumie podstawy w zakresie transferu technologii w odniesieniu do rozwiązań informatycznych, obejmujące takie zagadnienia jak instalacja oprogramowania, szkolenia użytkowników i systemy pomocy.", "IN_K3_U03_inz": "Absolwent potrafi pozyskiwać informacje z literatury, baz danych oraz innych źródeł, integrować je, dokonywać ich interpretacji oraz wyciągać wnioski i formułować opinie na temat problemów informatycznych oraz proponowanych rozwiązań.", "IN_K3_U04": "Absolwent potrafi pracować indywidualnie oraz w zespole informatyków, potrafi zarządzać swoim czasem oraz podejmować zobowiązania i dotrzymywać terminów.", "IN_K3_U22": "Absolwent potrafi wykazać się umiejętnością logicznego myślenia i porządkowania informacji w postaci wiedzy ogólnej.", "IN_K3_K03": "Absolwent jest gotów do wskazania przykładów i rozumie przyczyny wadliwie działających systemów informatycznych, które doprowadziły do poważnych strat finansowych, społecznych lub też do poważnej utraty zdrowia, a nawet życia.", "IN_K3_K04": "Absolwent jest gotów do zachowań profesjonalnych i przestrzegania zasad etyki, w tym uczciwości.", "IN_K3_K05": "Absolwent jest gotów do pracy zespołowej.", "IN_K3_K06": "Absolwent jest gotów do wykazania się skutecznością w realizacji projektów o charakterze społecznym, naukowo-badawczym lub programistyczno-wdrożeniowym, wchodzących w program studiów lub realizowanych poza studiami.", "W1": "Student zna i rozumie potrzeby w zakresie komercjalizacji wiedzy i technologii IT, potrzebę zarządzania procesem komercjalizacji, podejście oraz sposób pomiaru komercjalizacji, wdrożeń i transferu technologii; stosowane wskaźniki i miary komercjalizacji.", "U1": "Student potrafi zastosować miary komercjalizacji, ocenić potencjał komercjalizacji pod kątem własności intelektualnej, ocenić efekty ekonomiczne i społeczne związane z transferem technologii.", "K1": "Student jest gotów do pracy w zespołach, ustalania warunków komercjalizacji technologii i wiedzy."}}