{"Wstęp do programowania": "Tematyka ćwiczeń laboratoryjnych: \n·          Wprowadzenie do środowiska programistycznego\n·          Użycie zmiennych\n·          Wprowadzanie i wyprowadzenie danych\n·          Warunkowe i wielokrotne wywoływanie instrukcji\n·          Tablice \n·          Funkcje\n·          Rekurencja\n·          Obsługa plików\n·          Wyjątki\n·          Operacje bitowe\n·          Rekurencyjne struktury danych (np. Drzewo BST, lista jednokierunkowa) ", "Podstawy matematyki wyższej": "Rachunek zdań: koniunkcja, alternatywa, implikacja i ich zaprzeczenia; kwantyfikatory. Algebra zbiorów: sumy i przecięcia (również uogólnione); iloczyny kartezjańskie. Liczby wymierne i niewymierne. Pojęcie funkcji (odwzorowania); składanie odwzorowań, odwracalność. Podstawowe własności i operacje na funkcjach rzeczywistych i ich zastosowanie do rozwiązywania równań i nierówności. Przegląd funkcji elementarnych (wielomiany, funkcja modułowa, funkcje wymierne, logarytmiczne, wykładnicze, trygonometryczne, cyklometryczne). Geometria analityczna płaszczyzny: iloczyn skalarny wektorów, równania prostej (kierunkowe, ogólne, przez dwa punkty, odcinkowe, parametryczne). Odległość, odległość punktu od prostej. Pole równoległoboku. Krzywe stożkowe. Liczby zespolone. Interpretacja geometryczna, postać trygonometryczna i wzór de Moivre’a. Pierwiastkowanie liczb zespolonych. Zasadnicze Twierdzenie Algebry. Wyznaczanie pierwiastków zespolonych równań kwadratowych. Układy równań liniowych. Algebra macierzy. Wyznacznik, macierz odwrotna. ", "Podstawy analizy matematycznej": "Funkcje jednej zmiennej – podstawowe pojęcia i własności. Ciągi liczbowe. Granica ciągu. Liczba e. Rachunek granic. Symbole nieoznaczone. Granica i ciągłość funkcji. Własności funkcji ciągłych. Pochodna funkcji, różniczka. Twierdzenia o przyrostach. Wyznaczanie ekstremów. Badanie przebiegu zmienności funkcji. Wzór Taylora. Całka nieoznaczona. Całka oznaczona. Funkcja górnej granicy całkowania. Całki niewłaściwe. Zastosowania geometryczne i fizyczne całek pojedynczych. Przybliżone metody całkowania. ", "Matematyka dyskretna 1": "Elementy logiki matematycznej: klasyczny rachunek zdań (KRZ), funktory logiczne, wzmianka o aksjomatycznym podejściu do KRZ. Elementy rachunku funkcyjnego: funkcje (formy) zdaniowe, rachunek kwantyfikatorów, metody dowodzenia tożsamości kwantyfikatorowych. Elementy algebry zbiorów: podstawowe operacje na zbiorach (suma, iloczyn, różnica, dopełnienie), zbiory potęgowe, równoliczność zbiorów. Zbiory nieskończone: konsekwencje przyjętej definicji równoliczności zbiorów, zbiory przeliczalne i nieprzeliczalne, moc zbioru, naiwna i aksjomatyczna teoria mnogosci. Iloczyn kartezjański zbiorów i operacje uogólnione. Elementy teorii relacji i funkcji: relacja jako podzbiór iloczynu kartezjańskiego, relacje odwrotne, składanie relacji, relacje binarne, funkcje surjektywne, injektywne i bijektywne, funkcja jako relacja. Relacje równoważności, klasy abstrakcji i twierdzenia o podziale zbioru. Relacje porządkujące: relacje częściowego porządku, diagramy Hassego, element najmniejszy, element największy, elementy minimalne, elementy maksymalne, kresy dolne i górne, kraty. Porządki liniowe, łańcuchy, lemat Kuratowskiego-Zorna. Zbiory dobrze uporzadkowane, formalne uzasadnienie zasady indukcji matematycznej. ", "Podstawy fizyki": "Zagadnienia, którymi zajmuje się fizyka. Działy fizyki. Oddziaływania fundamentalne. Jednostki stosowane w fizyce.\nWprowadzenie matematyczne: pochodna funkcji jednej zmiennej, całka nieoznaczona i oznaczona, iloczyn skalarny i wektorowy, pochodne cząstkowe, operatory różniczkowe.\nKinematyka punktu materialnego. Opis położenia. Opis ruchu: tor, droga, prędkość i przyspieszenie. Klasyfikacja ruchów.\nPodstawowe pojęcia dynamiki: masa, siła i moment siły, pęd i moment pędu, energia, praca, moc. Zasady dynamiki Newtona. Równania ruchu. Zasady zachowania.\nWybrane zagadnienia dynamiki: ruch w centralnym i jednorodnym polu grawitacyjnym, siły oporu, ruch w jednorodnych polach elektrycznym i magnetycznym, ruch harmoniczny. Pole elektryczne: prawo Coulomba, natężenie pola elektrycznego, prawo Gaussa, zasada superpozycji, kondensatory, przewodniki i dielektryki.\nPole magnetyczne: wektor indukcji magnetycznej, prawo Biota-Savarta, prawo Ampere’a, przewodnik z prądem w polu magnetycznym.\nPrąd elektryczny: przewodnictwo elektryczne, natężenie prądu, prawo Ohma, równania Kirchhoffa, praca i moc prądu stałego. obwody prądu stałego, prawo indukcji Faradaya, indukcja wzajemna i własna, obwody prądu zmiennego.\nPrawa Maxwella. Fala elektromagnetyczna. Równanie ciągłości. Opis pól w różnych układach odniesienia. Elementy mechaniki kwantowej: podstawy doświadczalne, funkcja falowa, wartość oczekiwana wielkości fizycznej, operatory energii i pędu, zasada nieoznaczoności, równanie Schrödingera, studnia i próg potencjału, przejście przez barierę potencjału, budowa atomu.\nElementy fizyki ciała stałego: budowa kryształów, pasmowy model przewodnictwa, przewodniki, półprzewodniki i izolatory. ", "Rozumowania algorytmiczne": "Wprowadzenie do typów rozumowań algorytmicznych i ich specyfiki. Ogólne zasady  skutecznego rozwiązywania problemów. Metody heurystyczne i aksjomatyczne. Wprowadzenie i omówienie (w kontekście zagadek, łamigłówek i gier logicznych) takich pojć jak optymalizacja, prawdopodobieństwo, symulacja, graf, strategia i inne. ", "Ergonomia i BHP": "Wypadki przy pracy i choroby zawodowe – dane statystyczne, przyczyny, możliwości przeciwdziałania. Pojęcia podstawowe z zakresu ergonomii Wymagania prawne, zagrożenia, organizacja stanowiska pracy wyposażonego w monitor ekranowy Podstawowe zasady projektowania ergonomicznego ", "Programowanie obiektowe": "Wprowadzenie do programowania obiektowego. Pojęcie klasy i obiektu. Składowe klasy - pola i metody. Ochrona danych, hermetyzacja, specyfikacja dostępu do pól i metod, słowo kluczowe this. Składowe statyczne. Tworzenie, inicjalizacja i niszczenie obiektów. Przeciążanie konstruktorów. Projektowanie klas. Obiektowe modelowanie dziedziny. Dziedziczenie. Dziedziczenie a zawieranie. Hierarchia klas, konstruktory a dziedziczenie. Funkcje wirtualne i polimorfizm. Klasy abstrakcyjne i interfejsy. Zastosowanie interfejsów. Wyjątki. Przestrzenie nazw. Przeciążanie operatorów, indeksatory, funkcje konwertujące. Strumienie, praca z plikami, serializacja. Kolekcje. Typy ogólne. Mechanizm refleksji. ", "Analiza matematyczna": "Szeregi liczbowe.\nSzeregi funkcyjne–potęgowe, Taylora, szereg trygonometryczny Fouriera. Rachunek różniczkowy funkcji wielu zmiennych - pochodne cząstkowe, pochodna kierunkowa, wzór Taylora, ekstrema lokalne, globalne, ekstrema warunkowe (metoda mnożników Lagrange’a). Funkcje uwikłane. Rachunek całkowy funkcji wielu zmiennych- całka podwójna i potrójna, całkowanie po obszarach normalnych, zamiana zmiennych (współrzędne biegunowe, cylindryczne, sferyczne). Zastosowania geometryczne i fizyczne całek wielokrotnych. Równania różniczkowe zwyczajne -przykłady zjawisk prowadzących do równań różniczkowych. Elementarne równania pierwszego rzędu. ", "Algebra liniowa": "Macierze, ich rozszerzone własności i zastosowania (relacje, grafy, sieci). Rozwiązywanie układów równań liniowych - metody Cramera, macierzowa oraz eliminacji Gaussa. Interpretacja rozwiązań. Przestrzenie liniowe (w szczególności przestrzenie liniowe macierzy i funkcji). Liniowa niezależność wektorów. Baza i wymiar przestrzeni. Rozkład wektora w bazie, problem zmiany bazy, macierz przejścia. Odwzorowania liniowe, ich związek z macierzami i własności. Jądro i obraz odwzorowania. Macierze odwzorowania liniowego w różnych bazach. Przestrzenie liniowe z iloczynem skalarnym. Ortogonalność wektorów. Bazy ortonormalne. Rzut ortogonalny. Statystyczna interpretacja iloczynu skalarnego. Wielomian charakterystyczny, wartości i wektory własne odwzorowania (macierzy). Baza wektorów własnych. Macierzez diagonalizowalne i ich zastosowania. Wybrane pojęcia geometrii przestrzeni n-wymiarowej, równania prostych i hiperpłaszczyzn. Odwzorowania ortogonalne i izometrie przestrzeni. Formy kwadratowe, postacie kanoniczne, macierze i określoność form. Zastosowanie do opisu krzywych i powierzchni drugiego stopnia. ", "Podstawy elektroniki": "Perspektywy współczesnej elektroniki.\nZagadnienia ogólne i pojęcia podstawowe elektroniki. Materiały stosowane w elektronice.\nObwody prądu stałego. Prawa stosowane przy obliczaniu o.p.s.\nRachunek Liczb zespolonych .\nObwody prądu przemiennego. Prawa stosowane przy obliczaniu o.p.p.\nPodstawy układów analogowych. \nWybrane metody analizy obwodów.\nSprzężenia zwrotne w układach elektronicznych.\nWzmacniacze, klasyfikacja, parametry, właściwości.\nUkłady pracy wzmacniaczy operacyjnych.\nWybrane nieliniowe układy analogowe.\nGeneratory.\n\r\n Układy cyfrowe, właściwości i klasyfikacja. ", "Matematyka dyskretna 2": "Zasada indukcji matematycznej w różnych sformułowaniach i jej zastosowania. Współczynniki dwumianowe i ich zastosowania. Podstawy teorii zliczania, w tym zasada szufladkowa Dirichleta oraz zasada włączeń i wyłączeń. Elementy kombinatoryki. Rekurencja. Funkcje tworzące i ich zastosowania. Elementy teorii liczb. Arytmetyka modularna i jej zastosowania. ", "Laboratorium fizyki": "Blok ćwiczeń pomiarowych\r\n- Wykład wstępny dotyczący podstaw pomiarów\r\nfizycznych i szacowania ich błędów.\r\n- Ćwiczenia z termodynamiki (przemiana\r\nizotermiczna, wyznaczanie stałej adiabaty, ciepło\r\ntopnienia lodu)\r\n- Ćwiczenia z mechaniki (wyznaczanie\r\nwspółczynników tarcia, wyznaczenie współczynnika\r\nsprężystości, pomiar przyspieszenia ziemskiego za\r\npomocą wahadła matematycznego, doświadczalne\r\nwyznaczanie głównych momentów bezwładności)\r\n- Ćwiczenia z optyki (wykorzystanie zjawiska\r\ndyfrakcji do pomiaru grubości przesłony i szerokości\r\nszczeliny)\r\n- Ćwiczenia z elektromagnetyzmu (wyznaczanie\r\noporu omowego przewodników, znacznie stałej\r\ntermopary, zjawisko relaksacji w obwodzie\r\nelektrycznym) Blok ćwiczeń dotyczących komputerowej symulacji zjawisk fizycznych\n\r\n- Wykład wstępny dotyczący narzędzi symulacji zjawisk fizycznych - programy MATLAB lub Octave\n- Symulacja wybranych zjawisk fizycznych (sprzężone oscylatory, obwody elektryczne, ruch w polu grawitacyjnym, przejście sygnałów przez obwody elektryczne, symulacja powstawania błędów pomiarowych)\n- Wykorzystanie progrmów MATLAB lub Octave do opracowania danych pomiarowych ", "Psychologia": "1.       Przedmiot psychologii jako nauki, zarys historyczny.\n2.       Procesy psychiczne – podział, charakterystyka wybranych procesów.\n3.       Psychologia różnic indywidualnych, genetyka zachowania.\n4.       Temperament i osobowość - przegląd koncepcji, znaczenie funkcjonalne.\n5.       Dobrostan i zdrowie psychiczne – wskaźniki i modele w psychologii.\n6.       Wypalenie zawodowe  – definicje, modele, objawy, przebieg.\n7.       Stres w psychologii zdrowia – pojęcie, koncepcje, przyczyny, strategie radzenia sobie ze stresem.\n8.       Modele stresu zawodowego. Źródła zagrożenia zdrowia w środowisku pracy.\n9.       Czynniki salutogenne i satysfakcja z pracy.\n10.     Wybrane eksperymenty psychologiczne. ", "Filozofia": "I. Wprowadzenie \r\n1. Filozofia i jej działy \r\n2. Zagadnienia metafilozoficzne \r\n3a. Historia filozofii i jej periodyzacja \r\n3b. Problemy filozoiczne z perspektywy historycznej \r\nII. Zagadnienia ontologiczne \r\n4a. Spór o strukturę bytu \r\n4b. Byt a świadomość \r\n4c. Problem psychofizyczny \r\n5. Spór o uniwersalia \r\n6a. Spór o przyczynową naturę świata \r\n6b. Spór o celową naturę świata \r\nIII. Zagadnienia epistemologiczne \r\n7a. Klasyczne i nieklasyczne koncepcje prawdy \r\n7b. Wiedza \r\n8a. Spór o źródła i metody poznania \r\n8b. Spór o granice poznania \r\nIV. Zagadnienia z zakresu filozofii moralności i filozofii religii \r\n9a. Zagadnienia metaetyczne \r\n9b. Etyka a moralność. \r\n10. Postawa etyczna \r\n11. Główne stanowiska etyki normatywnej \r\n12. Spór o istnienie i naturę Boga ", "Socjologia": "Socjologia jako dyscyplina naukowa (źródła i etapy rozwoju socjologii, przedmiot badań socjologii, rozróżnienie socjologii jako wiedzy naukowej od wiedzy nienaukowej. Kultura jako podstawa życia społecznego. Nierówności społeczne i władza w teoriach socjologicznych. Świadomość społeczna w socjologii, mechanizmy powstawania i proces patologii. Zmiany społeczne, dynamika społeczna , procesy globalizacji. ", "Algorytmy i struktury danych": "Podstawowe pojęcia i zasady analizy algorytmów. Poprawność i skończoność algorytmów. Złożoność obliczeniowa i pamięciowa, notacje asymptotyczne. Metody konstruowania algorytmów (zachłanne, dziel i zwyciężaj, programowanie dynamiczne). Elementarne metody sortowania (przez wybieranie, przez wstawianie i bąbelkowe). Sortowanie przez wstawianie połówkowe, szybkie i przez scalanie. Sortowanie równoległe. Algorytmy sortowania w czasie liniowym. Kopce i sortowanie przez kopcowanie. Elementarne struktury danych oraz ich reprezentacja tablicowa i dowiązaniowa. Drzewa i ich notacja nawiasowa.  Drzewa BST – ich konstruowanie i zastosowanie. Reprezentacja grafów i podstawowe algorytmy na grafach – przeszukiwanie w głąb i wszerz. Algorytmy wyszukiwania (wyszukiwanie sekwencyne, wyszukiwanie w ciągu uporządkowanym, wyszukiwanie binarne, wyszukiwanie elementów wyróżnionych, wyszukiwanie mediany). Algorytmy wyszukiwania wzorca Programowanie dynamiczne (najdłuższe ścieżki w grafach, najdłuższy podciąg rosnący, najdłuższy współny podciąg, odleglość edycyjna, problem plecakowy, mnożenie macierzy). Algorytmy zachłanne (podstawy strategii zachłannej, problem wyboru zajęć, kody Huffmana). ", "Inżynieria oprogramowania": "Przedmiot obejmuje przedstawienie pojęć z inżynierii oprogramowania oraz narzędzi z tej dziedziny.\r\nPrezentowane są metody zarządzania projektem informatycznym, w tym problematyka jakości i bezpieczeństwa, metody i narzędzia  wspomagające tworzenie oprogramowanie (CASE), diagramy UML oraz zagadnienia związane z testowaniem oprogramowania, począwszy od debugowania programu, a skończywszy na testach akceptacyjnych.\nWykorzystanie wiedzy z wykładów do napisania i przetestowania aplikacji, włącznie z etapem negocjacji. Grupa laboratoryjna studentów pracuje wspólnie na zajęciach nad realizacją projektu. ", "Architektura komputerów": "Historia systemów komputerowych. Generacje komputerów oraz procesorów. Przerwa wydajnościowa. Prawo Moore’a. Asembler procesorów Intel x86 (przez DosBox). Organizacja systemów jednoprocesorowych (elementy tradycyjnej organizacji komputerów). Architektura von Neumanna oraz modyfikacje (architektura Harvard). Budowa procesora, pamięci oraz urządzeń magistrali systemowej. Zasady wykonywania programu w systemie komputerowym.  Metody programowania maszyn CISC i RISC (wykorzystanie rejestrów procesora, operacje  arytmetyczne i na łańcuchach znakowych). Reprezentacja danych w systemie komputerowym. Kod dwójkowy, reprezentacje liczb całkowitych i zmiennoprzecinkowych. Operacje arytmetyczne w kodzie dwójkowym. Norma IEEE 754. Budowa podstawowych układów sprzętowych do realizacji operacji arytmetycznych i logicznych. Jednostka arytmetyczno-logiczna i zmiennoprzecinkowa.  Wykorzystanie stosu, rejestrów indeksowych, zmiennoprzecinkowych i MMX. Polecenia (rozkazy) i argumenty instrukcji maszynowych. Wykorzystanie rozkazów. Rejestry procesora. Rozkazy do obliczeń wektorowych. Programowanie niskiego poziomu – asembler, tryby dostępu do pamięci, tryby adresowania w rozkazach. Stos. Współdziałanie programu z systemem operacyjnym, zarządzanie pamięcią. Metody adresowania i wykorzystanie ich w rozkazach. Klasyfikacja pamięci. Efektywność pamięci i procesora. Parametry czasowe pamięci. Pamięć główna, zewnętrzna (wirtualna) i podręczna. Tworzenie wstawek asemblerowych w języku wysokiego poziomu. Pamięci masowe – organizacja i zarządzanie. Pamięć wirtualna. Struktura fizyczna przechowywania danych na dysku.Wykorzystanie jednostki zmiennoprzecinkowej. Urządzenia wejścia-wyjścia. Parametry wydajnościowe urządzeń peryferyjnych. Sposoby komunikacji z urządzeniami zewnętrznymi. Moduły wejścia-wyjścia. Magistrale rozszerzeń. Technologia DMA.  Zastosowanie powyższych elementów do tworzenia prostych programów wykonujących operacje matematyczne oraz na łańcuchach znakowych. Organizacja współczesnych procesorów: architektury potokowe, superpotokowe i superskalarne. Procesory wielowątkowe i wektorowe.   Programowanie w trybie 16- i 32-bitowym. Wykorzystanie API Win32. Porównanie architektur RISC i CISC. Architektura IA-64. Asembler procesorów MIPS 2000 (poprzez symulator PC-Spim). ", "Rachunek prawdopodobieństwa i statystyka": "Bloki materiału:\nPodstawowe schematy i wzory kombinatoryki, doświadczenie losowe, zdarzenia elementarne, zbiory zdarzeń elementarnych i zdarzenia losowe, σ-ciało zdarzeń, przestrzeń probabilistyczna, aksjomaty prawdopodobieństwa i jego własności, prawdopodobieństwo klasyczne, prawdopodobieństwo geometryczne;\nWzór włączeń i wyłączeń, prawdopodobieństwo warunkowe, wzór łańcuchowy, prawdopodobieństwo całkowite, wzór Bayesa, niezależność zdarzeń losowych, schemat Bernoulliego.\nJednowymiarowe zmienne losowe i ich rozkłady, typy zmiennych losowych, pojęcia dystrybuanty i gęstości jednowymiarowej zmiennej losowej, własności dystrybuanty i gęstości, przykłady rozkładów jednowymiarowych zmiennych losowych, własności rozkładu normalnego, w tym reguła trzech sigm, pożyteczne przybliżenia rozkładu dwumianowego, charakterystyki liczbowe rozkładów jednowymiarowych zmiennych losowych (wartość oczekiwana, wariancja, odchylenie standardowe, momenty, kwantyle), funkcje zmiennych losowych;\nDwuwymiarowe zmienne losowe, ich rozkłady łączne, rozkłady brzegowe i warunkowe, pojęcia dystrybuanty i gęstości dwuwymiarowej zmiennej losowej, gęstości brzegowe, niezależność zmiennych losowych, pojęcia kowariancji i korelacji, nierówność Schwarza, własności kowariancji, interpretacja współczynnika korelacji, rozkłady sum niezależnych zmiennych losowych;\nCentralne Twierdzenie Graniczne (CTG), twierdzenie de Moivre’a-Laplace’a, nierówność Markowa, nierówność Czebyszewa, Prawo Wielkich Liczb (PWL);\nPodstawowe pojęcia wnioskowania statystycznego - pojęcia próby losowej, statystyki z próby i estymatora;\nWeryfikacja hipotez statystycznych - pojęcia statystyki testowej, wartości krytycznej, zbioru krytycznego, poziomu istotności testu, mocy testu oraz p-wartości;\nPodstawowe testy statystyczne – testy istotności dla średniej oraz dla frakcji (prawdopodobieństwa sukcesu), na równość średnich oraz na równość frakcji, test chi-kwadrat zgodności, test chi-kwadrat niezależności;\nEstymacja przedziałowa - pojęcie przedziału ufności, przedziały ufności dla średniej oraz dla frakcji (prawdopodobieństwa sukcesu), wyznaczanie realizacji przedziałów ufności. ", "Laboratorium elektroniki": "Omówienie zasad BHP w laboratorium. \nOmówienie sprawozdań laboratoryjnych.\nPomiar rezystancji przy pomocy omomierza w obwodach szeregowych, równoległych i mieszanych. \nPomiar pojemności kondensatorów.\nZastosowanie multimetru cyfrowego do pomiaru napięcia stałego i przemiennego. \nZastosowanie oscyloskopu cyfrowego do wizualizacji i pomiaru parametrów sygnałów przemiennych harmonicznych, prostokątnych i trójkątnych/ piłokształtnych. \nSprawdzanie napięciowego prawa Kirchhoffa.\nZdejmowanie charakterystyk układów wzmacniaczy.\nObliczanie charakterystyk logarytmicznych i ich interpretacja.\nZastosowanie generatora funkcyjnego jako źródła sygnału przemiennego. \nPrzekształcenia sygnałów funkcyjnych: prostokąt w harmoniczny lub w piłokształtny i na odwrót. Układ całkujący i różniczkujący. \nUkłady tranzystorowe jedno- i wielostopniowe.\n Wzmacniacze operacyjne: podstawowe własności WO, podstawowe układy. \nZastosowanie ujemnych sprzężeń zwrotnych. \nSymulacje komputerowe wybranych układów elektronicznych.\nPodsumowanie ćwiczeń laboratoryjnych, rozliczenie sprawozdań laboratoryjnych. Wystawianie ocen. ", "Formy działalności gospodarczej": "Zjawiska społeczno-ekonomiczne oraz procesy kształtujące współczesną gospodarkę. Działalność gospodarcza, przedsiębiorca, przedsiębiorstwo – istota, podstawowe charakterystyki i funkcje w organizacji i systemie społeczno-gospodarczym. Motywy i cele podejmowania działalności gospodarczej. Podmioty prowadzące działalność gospodarczą – formy organizacyjne i prawne przedsiębiorstw funkcjonujących we współczesnej gospodarce. Przedsiębiorstwo osoby fizycznej jako indywidualna aktywność gospodarcza przedsiębiorcy. Spółki prawa handlowego: spółki osobowe, spółki kapitałowe. Spółdzielnie i inne formy aktywności gospodarczej. Uwarunkowania zewnętrzne i wewnętrzne podejmowania działalności gospodarczej, jej prowadzenia i rozwoju. Swoboda i wolność gospodarcza w gospodarce rynkowej a ograniczenia dotyczące prowadzenia działalności: koncesje, licencje, zgody i zezwolenia na działalność gospodarczą, obowiązki publiczno-prawne przedsiębiorstw. Informacja ekonomiczna i finansowa o działalności podmiotu gospodarującego – potrzeby i obowiązki w zakresie gromadzenia informacji dla różnych grup odbiorców. Zakres, metody i szczegółowość podstawowych grup informacji o stanie finansowym, majątkowym i przebiegu prowadzonej działalności. Informacje o rodzajach działalności społeczno-gospodarczej - Polska Klasyfikacja Działalności. Formy prawne i ogólne warunki prowadzenia działalności gospodarczej w krajach Unii Europejskiej (wybrane przykłady). Społeczne, ekonomiczne i prawne determinanty prowadzenia działalności gospodarczej. Zasady podejmowania, prowadzenia i likwidacji działalności gospodarczej w przedsiębiorstwie osoby fizycznej oraz w spółkach cywilnych. Procedury związane z rozpoczynaniem i prowadzeniem działalności, wymogi formalne i obowiązki publiczno-prawne oraz podobieństwa i\r\nróżnice w spółkach prawa handlowego: spółki jawne, spółki partnerskie, spółki komandytowe, komandytowo-akcyjne, spółki z ograniczoną odpowiedzialnością i spółki akcyjne – organizacja i funkcjonowanie. Zasoby i finanse podmiotu gospodarującego i ich cechy. Źródła i formy finansowania działalności gospodarczej na przykładzie wybranych podmiotów gospodarczych. Sprawozdanie finansowe jako synteza podstawowych informacji o strukturze zasobów majątku, sytuacji finansowej oraz efektach prowadzonej działalności gospodarczej. Wstępna analiza sytuacji finansowej i wyników działalności przedsiębiorstwa. Podatkowe i nie podatkowe obciążenia podmiotów prowadzących działalność gospodarczą. Czynniki kształtujące aktywność gospodarczą podmiotów funkcjonujących w Polsce. Możliwości rozwoju i bariery w prowadzeniu działalności gospodarczej dla małych i średnich przedsiębiorstw. ", "Budowa serwisów internetowych": "·         Wprowadzenie do technologii klient-serwer ·         Wprowadzenie do HTML ·         Struktura strony w HTML (tabele)\n·         Formularze i ich elementy w HTML ·         Arkusze stylów CSS ·         Wprowadzenie do JavaScript ·         Walidacja danych na przykładzie JavaScript oraz wyrażeń regularnych ·         Podstawy XSL+XML ·         Wprowadzenie do PHP ·         Sesje w PHP - realizacja funkcjonalności logowania ·         PHP - połączenie z bazą danych MySQL - tworzenie aplikacji bazodanowej ·         Systemy CMS ", "Wychowanie fizyczne": "Zasady bezpieczeństwa na zajęciach z wychowania fizycznego. Podstawowe ruchy, poruszanie się i funkcjonowaniem ciała w trakcie wybranej aktywności ruchowej. Zasady i przepisy w wybranej dyscyplinie sportu. Organizacja i prowadzenie zawodów w ramach wybranej aktywności ruchowej. ", "Język angielski": "Słownictwo związane z edukacją, pracą, nauką, zdrowiem, kulturą i rozrywką, sportem, techniką, wymianą informacji oraz środowiskiem. Struktury gramatyczne: prawidłowe użycie form wyrazowych i konstrukcji zdaniowych, słowotwórstwo. Funkcje językowe: ćwiczenie komunikacji, wymowy oraz pisowni. ", "Język niemiecki": "Słownictwo związane z edukacją, pracą, nauką, zdrowiem, kulturą i rozrywką, sportem, techniką, wymianą informacji oraz środowiskiem. Struktury gramatyczne: prawidłowe użycie form wyrazowych i konstrukcji zdaniowych, słowotwórstwo. Funkcje językowe: ćwiczenie komunikacji, wymowy oraz pisowni. ", "Język rosyjski": "Słownictwo związane z edukacją, pracą, nauką, zdrowiem, kulturą i rozrywką, sportem, techniką, wymianą informacji oraz środowiskiem. Struktury gramatyczne: prawidłowe użycie form wyrazowych i konstrukcji zdaniowych, słowotwórstwo. Funkcje językowe: ćwiczenie komunikacji, wymowy oraz pisowni. ", "Język hiszpański": "Słownictwo związane z edukacją, pracą, nauką, zdrowiem, kulturą i rozrywką, sportem, techniką, wymianą informacji oraz środowiskiem. Struktury gramatyczne: prawidłowe użycie form wyrazowych i konstrukcji zdaniowych, słowotwórstwo. Funkcje językowe: ćwiczenie komunikacji, wymowy oraz pisowni. ", "Technologie baz danych": "Celem przedmiotu jest zapoznanie studentów z metodami pracy z bazami relacyjnymi. Studenci poznają podstawy języka T-SQL.\n \nTematyka wykładów:\r\n·          Wstęp do środowiska SQL Server 2016. Podstawowe narzędzia.\n·          Język SQL, zastosowanie, składnia.\n·          Wydobywanie danych z bazy danych.\n·          Filtrowanie danych i formatowanie wyników\n·          Funkcje oraz procedury systemowe.\n·          Wyświetlanie metadanych oraz informacji o SQLOS.\n·          Modyfikowanie danych i praca z transakcjami\n·          Praca z obiektami bazy danych.\n \nTematyka ćwiczeń laboratoryjnych: \n·          Elementy SQL Server Management Studio, praca z projektami i plikami.\n·          Praca z sqlcmd.\n·          Proste kwerendy.\n·          Formatowanie i filtrowanie wyników.\n·          Praca z funkcjami systemowymi.\n·          Grupowanie danych, klauzule ROLLUP, CUBE.\n·          Modyfikowanie danych.\n·          Praca z transakcjami.\n·          Procedury systemowe i użytkowników.\n·          Praca z funkcjami użytkowników.\n·          Praca z obiektami bazy danych.\n·          Tworzenie skryptów. ", "Systemy operacyjne": "Wprowadzenie do systemów operacyjnych: Definicje, historia, rola systemów operacyjnych.\nArchitektura systemów operacyjnych: Monolityczne, mikrojądro, hybrydowe.\nZarządzanie procesami: Cykl życia procesu, planowanie procesów, komunikacja międzyprocesowa.\nWielowątkowość: Wątki, modelowanie, synchronizacja.\nZarządzanie pamięcią: Pamięć wirtualna, segmentacja, stronicowanie.\nZarządzanie systemem plików: Hierarchia, prawa dostępu, systemy plików.\nSterowniki urządzeń: Wprowadzenie, interakcja z systemem operacyjnym, pisanie sterowników.\nBezpieczeństwo w systemach operacyjnych: Polityki bezpieczeństwa, mechanizmy ochrony, audyt systemowy.\nSystemy operacyjne czasu rzeczywistego: Cechy, zastosowania, systemy operacyjne RTOS.\nSieci w systemach operacyjnych: Protokoły sieciowe, TCP/IP, zarządzanie siecią.\nVirtualizacja i konteneryzacja: Wprowadzenie, technologie, zastosowania.\nSystemy operacyjne dystrybuowane: Architektura, komunikacja, spójność danych.\nSystemy operacyjne open-source: Linux, FreeBSD, zastosowania i porównanie.\nSystemy operacyjne dla urządzeń mobilnych: Android, iOS, systemy operacyjne na bazie Linuxa.\nNowe trendy w systemach operacyjnych: Systemy operacyjne dla chmur, dla IoT, dla dużych danych. ", "Metody numeryczne": "Wstęp\n\nArytmetyka zmiennopozycyjna. \nBłędy obliczeniowe. \nUwarunkowanie problemów numerycznych. \nZłożoność obliczeniowa algorytmu. Podstawowe algorytmy\n\nAlgorytm Herona.\nSchemat Hornera. Dokładne metody rozwiązywania układów równań liniowych. \n\nMetoda eliminacji Gaussa i Gaussa-Jordana.\nWybór elementu głównego.\nRozkłady LU i Cholesky’ego-Banachiewicza. Iteracyjne metody rozwiązywania układów równań liniowych. \n\nMetoda Richardsona.\nMetoda Jacobiego.\nMetoda Gaussa-Seidla. Aproksymacja średniokwadratowa. \n\nMetoda najmniejszych kwadratów.\nUogólnienie metody najmniejszych kwadratów. \nWielomiany ortogonalne. Równania nieliniowe. \n\nZbieżność i efektywność metody. \nMetody połowienia, stycznych, siecznych. Kryteria stopu. \nWielowymiarowa metoda stycznych. Optymalizacja\n\nZ wykorzystaniem pochodnej funkcji.\nMetoda złotego podziału.\nMetoda dzielenia na połowę.\nMetody stycznych i siecznych.\nWielowymiarowa metoda stycznych. Kwadratury. \n\nMetody najprostsze: prostokątów, trapezów. \nKwadratury Newtona-Cotesa: złożone metody trapezów, Simpsona. \nKwadratury Gaussa. \nKwadratury Monte-Carlo: średnia całkowa funkcji, metoda chybił-trafił. Zagadnienie własne. \n\nMetoda potęgowa. \nMetody Jacobiego i QR:\n\n\nortogonalizacja Grama-Schmidta,\nprzekształcenie Householdera,\nobroty Givensa. Równania różniczkowe\n\nJawna metoda Eulera.\nSchemat Runge-Kutty. ", "Grafy i sieci": "1.  Wprowadzenie do teorii grafów i sieci.  Podstawowe pojęcia\n2.  Definicje grafów prostych i multigrafów\n-      Część grafu, podgraf, podgrafy puste i pełne, baza grafu\n-      Marszrut, ścieżka, droga, cykl, odległości, stopni wierzchołków\n-      Sposoby opisywania grafów.\n3.  Własności klas grafów\n-      Grafy Eulerowskie\n-      Grafy Hamiltonowskie\n-      Grafy dwudzielne i planarne\n-      Pojęcia punktów rozdzielających, mostów i rozcięć 4.  Podstawowe algorytmy grafowe\n-      Przeszukiwanie wszerz\n-      Przeszukiwanie w głąb\n-      Sortowanie topologiczne 5.  Spójność grafów\n-      Klasyfikacja krawędzi. Spójność grafów nieskierowanych\n-      Drogi cykliczne w digrafach\n-      Silna spójność digrafu. Silnie spójne składowe digrafu 6.  Najkrótsze ścieżki\n-      Algorytm Dijkstry\n-      Algorytm Bellmana-Forda\n-      Najkrótsze ścieżki z jednym źródłem w acyklicznych grafach skierowanych\n-      Najkrótsze ścieżki między wszystkimi parami wierzchołków. Algorytm Floyda-Warszalla 7.  Drzewa\n-      Pojęcie lasów, właściwości drzew\n-      Minimalne drzewa rozpinające\n-      Algorytmy Kruskala i Prima. 8.  Przepływy i przepustowości w sieciach\n-      Sieci przepływowe. Przepływ maksymalny\n-      Metoda Forda-Fulkersona\n-      Maksymalne skojarzenie w grafach dwudzielnych. 9.  Zagadnienia związane z kolorowaniem grafów\n-      Pokrycia minimalne zbiorów\n-      Skojarzenia i pokrycia w grafach\n-      Chromatyka grafów. Oszacowanie liczby chromatycznej \n-      Metody kolorowania grafów ", "Ochrona własności intelektualnej": "W ramach godzin wykładowych studenci zapoznawani są z podstawowymi zagadnieniami z zakresu ochrony własności intelektualnej (prawo autorskie i prawa pokrewne, prawo własności przemysłowej, ochrona baz danych, zwalczanie nieuczciwej konkurencji i praktyk monopolistycznych, organy udzielające praw wyłącznych) ", "Metody analizy danych": "Elementy wielowymiarowej analizy danych – metody doboru cech diagnostycznych, normalizacja,ważenie cech diagnostycznych metody porządkowania liniowego obiektów – mierniki syntetyczne, syntetyczne mierniki rozwoju, metody grupowania obiektów bez nadzoru-metody skupień: hierarchiczne, k-średnich, modelowe wielowymiarowy rozkład normalny, regresja liniowa i logistyczna wybrane metody klasyfikacji obiektów (z nadzorem): LDA, QDA, Fishera, SVM, drzewa i lasy losowe, metody wzmacniania klasyfikatorów Metody redukcji danych: analiza składowych głównych, analiza korespondencji, analiza czynnikowa Wstępne informacje o analizie koszykowej i sieciach bayesowskich Przygotowanie studentów do wykonania projektów i własnych analiz: tworzenie zmiennych wskaźnikowych, analiza obserwacji nietypowych, uzupełnianie braków danych (EXCEL/R/Python) analiza regresji, skupienia, klasyfikacje, analiza głównych składowych, analiza czynnikowa, analiza korespondencji (EXCEL/R/Python) techniki wizualizacji danych (EXCEL/R/Python) ", "Potwierdzenie B2 język obcy": "Samodzielne przygotowanie do przystąpienia do egzaminu z jezyka obcego na poziomie B2 ", "Sieci komputerowe": "Wprowadzenie do sieci komputerowych, historia sieci, kierunki rozwoju\r\nTypy i topologie fizyczne sieci, okablowanie strukturalne sieci, standardy, media przewodowe\r\nModele OSI i model TCP/IP\r\nSieci Ethernet\r\nTechnologie i funkcjonowanie sieci pakietowych\r\nProtokół IPv4 oraz IPv6, Adresy IP, Maski sieci, Podział na podsieci\r\nVLSM adresacja i podział sieci \r\nRouting statyczny, Trasy domyślne i statyczne\r\nSieci przełączane, segmentacja sieci VLAN\r\nRouting dynamiczny. Protokoły routingu z wykorzystaniem wektora odległości, cechy, metryki\r\nRouting dynamiczny. Protokoły routingu z wykorzystaniem stanu łącza, cechy, metryki\r\nSieci WiFi, standardy 802.11, bezpieczeństwo \r\nProtokół DHCP, translacja adresów\r\nJakość transmisji QoS\r\nMechanizmy bezpieczeństwa w sieciach komputerowych Podział sieci komputerowych, adres, maska, broadcast\r\nBadanie i analiza ruchu w sieci, analizator wireshark\r\nProjektowanie warstwy fizycznej, standardy \r\nSystem operacyjny  IOS, konfiguracja\r\nKonfiguracja przełącznika, sieci VLAN\r\nKonfiguracja routingu statycznego\r\nKonfiguracja routingu dynamicznego \r\nKonfiguracja serwera DHCP\r\nUsługi sieciowe\r\nMechanizmy bezpieczeństwa w sieciach komputerowych\r\nProjekt sieci komputerowej  - case study ", "Techniki cyfrowe i podstawy systemów wbudowanych": "​Tematyka wykładów:\r\nWprowadzenie do techniki cyfrowej, algebra Boole’a, przekształcanie wyrażeń boolowskich. Minimalizacja funkcji boolowskich (mapy Karnaugha). Synteza układów kombinacyjnych. Kombinacyjne automaty (układy) cyfrowe - multiplexery i demultipleksery. Dynamika automatów cyfrowych, zjawiska hazardu i wyścigu. Konwertery kodów. Sekwencyjne automaty (układy) cyfrowe. Asynchroniczne automaty sekwencyjne. Synchroniczne automaty sekwencyjne. Rejestry i Liczniki. Przetworniki analogowo-cyfrowe i cyfrowo- analogowe.\nTematyka ćwiczeń laboratoryjnych: laboratorium w praktyczny sposób będzie pogłębiało wiadomości teoretyczne uzyskane na wykładzie z zakresu syntezy, analizy i uruchamiania różnych klas automatów cyfrowych – kombinacyjnych i sekwencyjnych. Omawiane będą zjawiska hazardu i wyścigu w automatach cyfrowych oraz metody komputerowego projektowania urządzeń cyfrowych. Tematyka ćwiczeń obejmuje badanie i projektowanie układów cyfrowych. ", "Paradygmaty programowania": "Wprowadzenie Programowanie proceduralne Programowanie funkcyjne Programowanie imperatywne Programowanie obiektowe Programowanie wizualne Programowanie uogólnione Programowanie sterowane zdarzeniami Programowanie logiczne (Prolog) Programowanie aspektowe (AspectJ) Programowanie deklaratywne Programowanie agentowe Paradygmaty algorytmiczne: uczenie maszynowe Paradygmaty algorytmiczne: rekurencyjne sieci neuronowe Paradygmaty algorytmiczne: splotowe sieci neuronowe Paradygmaty algorytmiczne: generatywne, przeciwstawne sieci neuronowe ", "Praktyki": "Zakres praktyki może obejmować:\n\npracę w zespole przygotowującym oprogramowanie użytkowe,\npracę w zespole zajmującą się obsługą informatyczną przedsiębiorstwa,\npracę w zespole zajmującą się analizą danych empirycznych,\npracę w różnych jednostkach administracyjnych w celu zapoznania się z problematyką i metodami pracy,\npomoc w zarządzaniu komputerową siecią lokalną i oprogramowaniem,\ninne prace zlecone przez kierownika przedsiębiorstwa. ", "Dynamiczna analiza oprogramowania": "Wprowadzenie do dynamicznej analizy oprogramowania (definicja i znaczenie, różnice miedzy analizą dynamiczną i statyczną, podstawowe techniki i narzędzia). Testowanie jednostkowe (podstawy, tworzenie zestawów testów jednostkowych, wykorzystanie frameworków do testowania jednostkowego, automatyzacja testów). Testowanie integracyjne (zasady, strategie, wykorzystanie frameworków). Testowanie funkcjonalne (planowanie, tworzenie scenariuszy testowych i zestawów danych testujących, automatyzacja). Testowanie wydajności (definicje i kryteria wydajności, przeprowadzanie testów i analiza wyników, optymalizacja wydajności oprogramowania). Debugowanie oprogramowania (podstawy, techniki i narzędzia, analiza śladów wykonania, logów i danych diagnostycznych). Narzędzia wspierające dynamiczną analizę oprogramowania (przegląd popularnych narzędzi, zasady wyboru odpowiednich narzędzi dla konkretnych zastosowań). ", "Analiza statyczna oprogramowania": "Przeglądy oprgramowania jak forma statycznej analizy oprgramowania\n\nFormy przeglądów (formalny, nieformalny, techniczny, przegląd mendżerski, inspekcja, audyt)\nMetodyka i ogranizacja przeglądów z uwzględnieniem ról\nWdrażnie przeglądów Analiza statyczana oprogramowania\n1. Podstawwe definicje\n2. Rodzaje analiz statycznych (składniowa, semantyczna, zależności wydajnościowa, bezpieczeństwa, formalne dowodznie poprawności).\n3. Metody analizy statycznej oprogramowania (anliza przepływu sterowania, analiza przepływu danych, analiza poprawności sekwencji operacji, parsowanie kodu, testy zgodności ze standardami programowania, generowanie metryk złozoności kodu, symboliczne wykonywanie kodu, dowody formalne). Zapozanie studentów z wybranymi narzędziami do automatycznej analizy kodu dostępnymi w kompilatorach i zintegrowanych środowiskach progamistycznych.\nZastosowanie tzw. holistycznych narzędzi testowania statycznego np.  SonarQube, PWD, Understand.\nPraktyka wykonywania prostych przeglądów oprogramowania. ", "Architektura oprogramowania": "Wykład:  Cykl biznesowy tworzenia architektury; Czym jest architektura oprogramowania; Zrozumienie atrybutów jakościowych; Osiąganie cech jakościowych. Projektowanie architektury; Dokumentowanie architektury; Rekonstrukcja architektury; Dekompozycja modułowa; Studia przypadków.\n \nLaboratoria:  Diagramy UML w projektowaniu architektury, Architektura 4+1 widok. Wzorce projektowe – praktyczne wykorzystanie. Architektura klient serwer. Dekompozycja modułowa. Architektura MVC. ASP.NET MVC. Analiza architektury przykładowych systemów. \n \nProjekt:  zaprojektowanie architektury i wykonanie prostego systemu. ", "Programowanie komponentowe": "Przypomnienie podstaw programowania proceduralnego w wybranym języku programowania: wprowadzanie i wyprowadzanie danych, instrukcja warunkowa, instrukcja iteracyjna WHILE, instrukcje iteracyjne FOR, sekwencje – łańcuchy znaków, krotki, listy i słowniki, funkcje i ich wykorzystanie do tworzenia własnych modułów i pakietów, programy z argumentami pozycyjnymi, obsługa wyjątków, operacje na plikach Przypomnienie podstaw programowania obiektowego w wybranym języku programowania: klasy, metody, obiekty i pola, konstruktory i atrybuty klas, polimorfizm i dziedziczenie Tworzenie interfejsów graficznych GUI z wykorzystaniem wybranego języka programowania jako przykład wykorzystania paradygmatu programowania obiektowego. Wykorzystanie elementów graficznych i multimedialnych Pojęcie interfejsu. Przykłady wykorzystania interfejsów w programowaniu obiektowym Wprowadzenie do programowania komponentowego. Teoria i inżynieria oprogramowania komponentowego. Wzorzec odwróconego sterowania. Pojęcie i rola kontenera Przegląd wybranych technologii komponentowych Wykorzystanie odpowiedniego pakietu (biblioteki) wybranego języka programowania do tworzenia komponentów. Typy komponentów i ich użycie. Cykl życia komponentów. Wersjonowanie komponentów Tworzenie aplikacji w wybranej technologii komponentowej ", "Teoria algorytmów": "1.  Wprowadzenie. Podstawowe pojęcia i właściwości algorytmów. Zasady analizy algorytmów, klasy zadań, rodzaje algorytmów, metody układania algorytmów 2.  Podstawowe modele obliczeniowe\n-      Złożoność algorytmów\n-      Funkcje rekurencyjne\n-      Maszyna o swobodnym dostępie do pamięci (RAM) 3.  Gramatyki i języki formalne\n-      Alfabety i języki\n-      Skończone reprezentacje języków 4.  Automaty skończone\n-      Deterministyczne automaty skończone\n-      Niedeterministyczne automaty skończone\n-      Automaty skończone i wyrażenia regularne\n-      Algorytmy dla automatów skończonych 5.  Języki bezkontekstowe\n-      Gramatyki bezkontekstowe\n-      Algorytmy dla gramatyk bezkontekstowych 6.  Maszyny Turinga\n-      Maszyna Turinga jako najprostszy model obliczeniowy\n-      Rozszerzenia maszyny Turinga \n-      Maszyna Turinga o swobodnym dostępie do pamięci\n-      Gramatyki\n-      Funkcje numeryczne 7.  Nierozstrzygalność\n-      Teza Churcha-Turinga\n-      Uniwersalne maszyny Turinga\n-      Problemy nierozwiązywalne algorytmiczne\n8.  Złożoność obliczeniowa\n-      Klasa P\n-      Klasa NP\n-      Problemy NP-zupełne ", "Podstawy teleinformatyki": "​Tematyka wykładów. Zjawiska przepływu prądu elektrycznego w obwodach RLC.  Zjawiska optyczne w ujęciu geometrycznym i falowym. Równania Maxwella. Rodzaje mediów transmisyjnych – kable miedziane i światłowodowe, łączność radiowa i satelitarna. Podstawy teorii sygnałów. Sygnały analogowe i cyfrowe. Próbkowanie sygnału, kryterium Shannona, kompresja sygnału, kodowanie typu „delta”\r\nPrzetwarzanie sygnałów analogowo-cyfrowe i cyfrowo-analogowe. Zagadnienia modulacji i detekcji. Systemy teletransmisyjne – kodowanie liniowe, PCM, sieci ATM, PDH, SDH. Ochrona i archiwizacja danych, podstawy kryptografii.\nTematyka ćwiczeń laboratoryjnych. Symulacje komputerowe dotyczące formowania się modów światłowodowych, szerokości pasma transmisyjnego, kodowania, charakterystyk częstotliwościowych sygnałów i kanałów transmisyjnych. Pomiary w sieciach teleinformatycznych. Badanie połączeń elektrycznych i tłumienia torów teletransmisyjnych symetrycznych i koncentrycznych.\r\nBadanie właściwości transmisyjnych światłowodów. Metody transmisji danych przy pomocy tego medium. ", "Systemy multimedialne": "Wprowadzenie do systemów multimedialnych: historia, ewolucja i aktualne trendy.\nPodstawy technologii multimedialnej: dźwięk, wideo, grafika, tekst, i interaktywność.\nFormaty plików multimedialnych: porównanie, konwersja i zastosowania.\nAlgorytmy kompresji multimedialnej: teoria i praktyka.\nSystemy transmisji multimedialnej: streaming, protokoły transmisji danych.\nTworzenie treści multimedialnych: narzędzia i techniki.\nInteraktywne media: tworzenie gier i aplikacji.\nMultimedialne interfejsy użytkownika: projektowanie i ocena.\nSystemy multimedialne w edukacji: e-learning i technologie edukacyjne.\nSieci społecznościowe i multimedia: tworzenie, udostępnianie i interakcja.\nTechnologie wirtualnej i rozszerzonej rzeczywistości w systemach multimedialnych.\nBezpieczeństwo i ochrona danych w systemach multimedialnych.\nMultimodalne interakcje i systemy multimedialne: systemy rozpoznawania mowy, dotyku i ruchu.\nPrzyszłość systemów multimedialnych: AI, machine learning i multimedia.\nWpływ systemów multimedialnych na społeczeństwo i kulturę: etyka i odpowiedzialność. ", "Podstawy fotografii cyfrowej": "Wstęp do fotografii. Podstawowe pojęcia - ekspozycja, czułość, przesłona. Sprzęt - body i obiektywy. Ustawianie ostrości. Pomiar światła. Podstawy kadrowania - różne typy ujęć. Perspektywa. Dobór odpowiedniego sprzętu do zadania. Wyjście w plener. Podstawy postprodukcji. Fotografia przyrodnicza i sportowa. Dobór sprzętu i ustawień. Panning. Wyjście w plener. Postprodukcja. Makrofotografia. Dobór sprzętu - obiektywy makro, statywy, sanki nastawcze, światło w makrofotografii. Pojęcie głębi ostrości, stackowanie zdjęć. Fotografowanie w skali 1:1 i w powiększeniu. Postprodukcja. Fotografia portretowa i studyjna. Dobór sprzętu i oświetlenie. Rodzaje oświetlenia, różne jego kierunki. Praca z oświetleniem i modelem. Postprodukcja. Fotografia portretowa w plenerze. Dobór sprzętu i oświetlenie. Rodzaje oświetlenia, różne jego kierunki. Praca z oświetleniem i modelem. Postprodukcja. Zamrażanie ruchu. Posługiwanie się światłem błyskowym. Postprodukcja. Fotografia produktowa i stockowa. Namiot bezcieniowy. Postprodukcja. Ocena zdjęć pod kątem technicznym i artystycznym. Konkurs fotograficzny. ", "Wirtualizacja i Konteneryzacja": "Wprowadzenie do wirtualizacji: Definicja, historia, zalety i wady.\nTypy wirtualizacji: Wirtualizacja pełna, parawirtualizacja, wirtualizacja na poziomie systemu operacyjnego.\nArchitektura systemów wirtualizacyjnych: Hypervizor, maszyna wirtualna, sprzęt wirtualny.\nNajpopularniejsze narzędzia do wirtualizacji: VMware, VirtualBox, Hyper-V, KVM.\nZarządzanie i konfiguracja maszyn wirtualnych.\nWirtualizacja w chmurze: Amazon EC2, Google Compute Engine, Azure Virtual Machines.\nWprowadzenie do konteneryzacji: Definicja, historia, zalety i wady.\nDocker: Podstawy, instalacja, tworzenie obrazów i kontenerów.\nKubernetes: Podstawy, architektura, zarządzanie klastrami.\nPraktyczne zastosowania konteneryzacji: Ciągłe dostarczanie (Continuous Delivery), mikroserwisy, DevOps.\nBezpieczeństwo w wirtualizacji i konteneryzacji: zagrożenia, zabezpieczenia, praktyki bezpieczeństwa.\nMonitorowanie i debugowanie w środowiskach wirtualnych i kontenerowych.\nPrzykłady implementacji: Studia przypadków zastosowania wirtualizacji i konteneryzacji w przemyśle.\nPrzyszłość wirtualizacji i konteneryzacji: Trendy, wyzwania, możliwości.\nProjekt końcowy: Planowanie i wdrażanie rozwiązania opartego na wirtualizacji lub konteneryzacji w wybranym scenariuszu biznesowym. ", "Usługi Devops (CKA)": "Omówienie podstawowych zagadnień DevOps.\r\nPrzedstawienie zagadnień automatyzacji w zakresie tworzenia i konfiguracji platformy wykonawczej: Terraform, Ansible, Vagrant.\r\nKonteneryzacja usług (Docker, Kubernetes).\r\nCiągła integracja, ciągłe wdrażanie oraz procesy automatyzacji budowy i wdrażania (Jenkins).\r\nTestowanie i monitorowanie aplikacji.\r\nDobre peaktyki DevOps. Tworzenie i konfiguracja maszyn wirtualnych z wykorzystaniem mechanizmów autoamatyzacji.\r\nWykorzystanie wirtualizacji i kontenerów we wdrożeniu oraz automatyzacja wdrożenia projektu oprogramowania.\r\nRealizacja automatyzacji dla testowania i monitorowania projektu oprogramowania. ", "Grafika komputerowa i komunikacja z komputerem": "Wstęp. Urządzenia graficzne wejścia-wyjścia. Podstawowe pojęcia i definicje dotyczące obrazów cyfrowych (w technice rastrowej i wektorowej) oraz modeli kolorów. Punktowe, lokalne i globalne metody przekształcania obrazów. Transformacje geometryczne obiektów graficznych i wypełnianie figur. Eliminacja elementów zasłoniętych, metody kreślenia krzywych. Modele oświetlenia i cieniowania. Przekształcenia morfologiczne i ich zastosowania. Transformaty obrazów i sygnałów dźwiękowych (FFT, Hough, Radon). Wybrane metody filtracji danych jedno- i dwuwymiarowych. Wybrane modele interakcji człowiek-komputer. Zasady projektowania i analizy interfejsów komputerowych. Interfejsy dla osób niepełnosprawnych. Interakcja człowiek-komputer dla komputerów przyszłości. ", "Projekt zespołowy": "Proces projektowania: Wprowadzenie do podstaw projektowania, omówienie metodologii projektowania, takich jak Design Thinking.\nWybór projektu: Strategie i techniki doboru odpowiedniego projektu zespołowego, który jest odpowiedni dla umiejętności i zainteresowań zespołu.\nZarządzanie projektem: Wprowadzenie do narzędzi i technik zarządzania projektem, takich jak Agile lub Scrum.\nPraca zespołowa: Techniki i strategie efektywnej pracy zespołowej, w tym komunikacja, podział obowiązków i zarządzanie konfliktami.\nDokumentacja projektu: Jak skutecznie dokumentować proces projektowy, wyniki i decyzje.\nPrezentacja projektów: Jak skutecznie prezentować swoje projekty, w tym techniki prezentacji i umiejętności komunikacyjne.\nPrototypowanie i testowanie: Jak tworzyć i testować prototypy swoich projektów, w tym techniki prototypowania szybkiego i testowania użytkowników.\nOcena ryzyka: Jak identyfikować i zarządzać ryzykiem w projektach.\nFinansowanie projektów: Omówienie podstawowych zasad finansowania projektów, w tym budżetowania i pozyskiwania środków.\nEtyka w projektowaniu: Rozważania etyczne podczas prowadzenia projektów, w tym wpływ na społeczność i środowisko.\nUżytkowanie i utrzymanie: Jak planować i zarządzać etapem użytkowania i utrzymania w cyklu życia projektu.\nNarzędzia do współpracy: Przegląd popularnych narzędzi do współpracy zespołowej, takich jak Trello, Slack czy GitHub.\nPrzegląd technologii: Omówienie aktualnych trendów technologicznych, które mogą być wykorzystane w projektach.\nPraktyka projektowa: Sesje praktyczne, podczas których studenci pracują nad swoimi projektami pod nadzorem wykładowców.\nWprowadzenie do zarządzania zasobami ludzkimi: Omówienie podstawowych zasad zarządzania zasobami ludzkimi w kontekście projektu, w tym rekrutacji, motywacji i oceny członków zespołu. ", "Problemy społeczne i zawodowe informatyki": "Zagadnienia społeczne informatyki – wprowadzenie.\nZawody informatyczne i edukacja informatyków.\nPoszukiwanie pracy.\nSpecyfika środowiska informatyków. Podstawy przedsiębiorczości i efektywne zarządzanie czasem.\nRyzyko przedsięwzięć informatycznych. Podstawy ochrony danych osobowych. Przestępczość elektroniczna.\nPodstawy etyki zawodowej i etyka w informatyce. Historia technologii obliczeniowych i drogi zawodowe wybranych znanych postaci. ", "Seminarium dyplomowe": "Kwestie wyboru tematu rozprawy. Specyfika tekstu technicznego.\nStruktura, treść, forma rozprawy (format rozprawy w SGGW).\nJęzyk i styl tekstu pisanego i wypowiedzi; podstawy dobrego stylu pisania; podstawy ekspresyjnego wypowiadania się. Strona redakcyjna i graficzna rozprawy i prezentacji. Wskazania ogólne i wybrane wskazania szczegółowe. Cytowania i literatura. Dobór literatury, sposoby cytowania, sposoby tworzenia bibliografii. Najczęstsze błędy w rozprawach, wskazówki jak ich unikać.\nJak zabierać się do pisania rozprawy? Prezentacje studenckie.\nWiększość zajęć jest poświęcona prezentacjom referatów studenckich na temat koncepcji, przebiegu i wyników własnej pracy studentów nad pracą, w formie ustnych prezentacji wspieranych multimedialnie. Prezentacje są prowadzone w stylu konferencyjnym, z dyskusją w grupie studenckiej animowaną przez prowadzącego.\nTematy 1-5 są omawiane w formie wykładów podczas wybranych zajęć i ich treści są wplatane w komentarze do prezentacji studenckich. ", "Testy penetracyjne": "Podstawy testów penetracyjnych: Definicja, cel, znaczenie.\nMetodologie testów penetracyjnych: OWASP, PTES, OSSTMM.\nNarzędzia do testów penetracyjnych: Kali Linux, Metasploit, Burp Suite, Wireshark.\nTesty penetracyjne sieci: Skanowanie sieci, identyfikacja luk, wykorzystanie luk.\nTesty penetracyjne aplikacji webowych: SQL Injection, Cross-Site Scripting, CSRF.\nTesty penetracyjne na poziomie systemu operacyjnego: ataki na poziomie kernela, eskalacja uprawnień.\nTesty penetracyjne mobilnych aplikacji: specyfika platform iOS i Android, narzędzia do testowania.\nTesty penetracyjne IoT (Internet of Things): Specyfika, zagrożenia, metody testowania.\nSocial Engineering jako element testów penetracyjnych: Phishing, baiting, tailgating.\nWprowadzenie do inżynierii wstecznej i wykorzystania jej w testach penetracyjnych.\nTworzenie skryptów do automatyzacji testów penetracyjnych: Python, Bash.\nTesty penetracyjne baz danych: SQL Injection, Blind SQL Injection.\nTesty penetracyjne chmury: AWS, Google Cloud, Azure.\nAnaliza wyników testów penetracyjnych i tworzenie raportów.\nEtyka w testach penetracyjnych: prawne aspekty, regulacje, umowa o nieujawnianiu (NDA). ", "Audyt bezpieczeństwa": "Wprowadzenie do zarządzania bezpieczeństwem systemów informatycznych Zarządzania ryzykiem systemów informacyjnych:\r\n- Ochrona zasobów,\r\n- szacowanie i postępowanie z ryzykiem dla procesów biznesowych\r\n- rozwój i utrzymanie systemów\r\n- ciągłość działania usług. Wprowadzenie do audytowania - audyt wytycznych norm i etyki zawodu:\r\n- Ogólnie przyjęte standardy audytu (ISACA, ITIL itp.) Przeprowadzenie audytu systemu informacyjnego:\r\n- Audyt wewnętrzny i audyt zewnętrzny Tworzenia dokumentacji polityki bezpieczeństwa systemów :\r\n- Tworzenie księgi polityki bezpieczeństwa,\r\n- Tworzenie planów ciągłości działania (BCP) Systemy krytyczne i infrastruktura krytyczna Państwa (pojęcia, typy systemów krytycznych, typ infrastruktury krytycznej, projektowanie bezpiecznego oprogramowania dla systemów krytycznych). Tworzenie Macierzy ryzyka:\r\n- Identyfikacja i klasyfikacji zasobów\r\n- identyfikacja i klasyfikacja zagrożeń\r\n- opracowanie scenariuszy ryzyka. Przeprowadzenie audytu IT na zgodność z normą ISO/IEC 27001 z wykorzystaniem narzędzi RISIBASE:\r\n- Audyt bezpieczeństwa fizycznego,\r\n- Audyt bezpieczeństwa sieciowego\r\n- Audyt bezpieczeństwa środowiskowego IT,\r\n- Audyt pozyskiwania, rozwoju i utrzymywania systemów i aplikacji Oszacowanie i postępowanie z ryzykiem z wykorzystaniem narzędzia RISICARE Techniki raportowania wyników kontrolnych/pokontrolnych z analizy i audytów:\r\n- sformułowanie wniosków i rekomendacji,\r\n- sformułowanie dowodów niezgodności,\r\n- sformułowanie zmian, uzupełnień itp. w polityce bezpieczeństwa, planów ciągłości działania (BCP) ", "Bezpieczeństwo sieci": "Ataki sieciowe i sposoby zapobiegania\r\nZasady działania AAA - autoryzacja, autentykacja i accounting implementacja na routerach i przełącznikach \r\nKontrola dostępu w warstwie 2 Protokoły LEAP, PEAP, EAP-TLS, EAP-MD5, działanie  protokołu 802.1X\r\nListy kontroli dostępu ACL\r\nZasada działania i konfiguracja firewalla na routerach \r\nZasada działania Zoned-Based Policy Firewall\r\nSzyfrowanie połączeń w sieciach komputerowych \r\nZasada działania i implementacja połączeń IPSEC VPN site-to-site\r\nImplementacja GRE Tunnels\r\nZasada działania i sposoby konfiguracja połączeń IPSEC VPN remote-site.\r\nZabezpieczenia sieci w oparciu o ASA Firewall\r\nWykrywanie włamań i kontrola ruchu w sieci IDS\r\nZasada działania i konfiguracja IOS IPS  \r\nZarządzanie i audyt bezpieczeństwa Kontrola dostępu do urządzeń sieciowych i bezpieczeństwo infrastruktury\r\nZabezpieczenie warstwy sieci w oparciu o routery\r\nKonfiguracja urządzeń ASA\r\nKonfiguracja serwera ACS\r\nImplementacja Firewall’a w oparciu o listy ACL\r\nImplementacja zabezpieczenia sieci realizowana w oparciu o protokoły IPSec\r\nProtokoły SSL, GRE/IPsec, Tunele Generic Routing Encapsulation (GRE) bezpieczne tunele GRE\r\nImplementacja i szyfrowane połączeń VPN na routerach i urządzeniach ASA. \r\nImplementacja mechanizmów zabezpieczenia i wykrywania włamań IPS\r\nTuning sygnatur w systemach IPS\r\nBezpieczeństwo w sieciach bezprzewodowych\r\nAudyt bezpieczeństwa\r\nProjekt i implementacja zabezpieczenia dostępu do sieci komputerowej ", "Projektowanie bezpiecznych aplikacji": "Wprowadzenie do projektowania zabezpieczeń – omówienie podstawowych pojęć związanych z bezpieczeństwem teleinformatycznym. Obowiązujące normy i standardy. Zasad tworzenie profili i zadania zabezpieczeń dla dowolnych aplikacji Przykłady tworzenie profili iZadania Zabezpieczeń - Wytyczne zgodnie z Common Criteria Podział na role i odpowiedzialności w projekcie. Omówienie procedur zarządzania wersjami i zmianami oraz systemów wspomagających nadzór nad procesem (GitLab, Subversion itp.). Metodyka oceny bezpiecznych aplikacji – omówienie metodyk oceny bezpiecznych aplikacji CEM. Projektowanie aplikacji – omówienie narzędzi wspomagających wytwarzanie bezpiecznych aplikacji oraz sposoby ich wykorzystania. Omówienie wzorców projektowych wymaganych do obsługi złożonych aplikacji. Konstruowanie i wsparcie w cyklu życia aplikacji – zdefiniowanie narzędzi konstrukcyjnych stosowanych do analizy i implementacji aplikacji oraz omówienie techniki śledzenia i usuwania błędów Omówienie techniki tworzenia dokumentacji dla wymagań funkcjonalnych, projekt niskiego i wysokiego poziomu oraz uzasadnienie zgodności między nimi. Testowanie bezpieczeństwa aplikacji – omówienie rodzajów wymaganych testów oraz narzędzi. Omówienie techniki tworzenia scenariuszy, przypadków i procedur testowych wraz ze specyfikacjami Tworzenie profilu i zadań zabezpieczeń aplikacji z użyciem oprogramowania CCtoolbox Zarzadzania konfiguracją aplikacji (zarządzanie wersjami i zmianami zgodnie z wymaganiami CC) z wykorzystaniem dostępnych narzędzi (np. GitLab/Subversion, etc.) Przygotowanie projektu aplikacji z wykorzystaniem wzorców projektowych Wykorzystanie narzędzi (np. code climate, codacy czy SonarQube) do sprawdzania jakości kodu aplikacji Testowania (test funkcjonalny, pokrycia i głębokości z wykorzystaniem ECJTiger, EMMA, Metasploit, etc.) kodów aplikacji oraz ich bezpieczeństwa (np. testy penetracyjne). ", "Ochrona informacji i bezpieczeństwo systemów komputerowych": "Wprowadzenie do ochrony informacji (właściwości bezpieczeństwa, uwierzytelnienie i autoryzacja, koncepcja zaufania i wiarygodności, zagrożenia i ataki). Zarządzania bezpieczeństwem systemów informatycznych\n-      Analiza i szacowania ryzyka\n-      Postępowania z ryzykiem\n-      Polityka bezpieczeństwa\n-      Zarządzania ciągłością działania Podstaw kryptografii symetrycznej a asymetrycznej\n-      Kryptografia symetryczna a asymetryczna\n-      Zaawansowane protokoły kryptograficzne. Metody uwierzytelnienie danych (metody oparty na wiedzy, posiadaniu i cechy osobistej, siła protokołów uwierzytelniana, techniki ataków na hasła, techniki przechowywania haseł, kody uwierzytelniania wiadomości). Kontrola dostępu (fizyczne zabezpieczenie danych, logiczna kontrola dostępu do danych, projektowanie bezpiecznej architektury, techniki zapobiegania wyciekowi informacji). Protokoły bezpiecznej komunikacji (protokoły SSL/TLS, SSH, HTTPS, ataki na protokół TLS, protokoły IPsec i VPN) Badanie działania i właściwości szyfrów kryptograficznych kryptografii symetryczna i asymetryczna Zabezpieczenie wymiany informacji (np. poczta elektroniczna). Protokoły bezpiecznej komunikacji. Wybrane techniki hakerskie i obrona przed nimi. ", "Programowanie w Internecie": "Wprowadzenie, Aplikacje Webowe, Strony Internetowe Układ strony, HTML5 i CSS3\nJavaScript - język skryptowy po stronie klienta.\nResponsive Web Design, Preprocesory, Zaawansowany layout stron.\nWyrażenia regularne w JavaScript i walidacja formularzy oraz niestandardowe akcje na stronie. Wprowadzenie do Komunikacji z Serwerem POST, GET, SOAP i inne powiązane metody komunikacji.\nJęzyki Server side C# ASP .NET i MVC .NET, JavaScript Node.JS, PHP (Zend), Python (Django)\nKomunikacja z Bazami Danych I Autentykacja Użytkownika Prezentacja projektów wykonanych w trakcie zajęć. ", "Systemy przetwarzania danych": "Systemy analizy i przetwarzania danych (SPD)  – definicje, funkcje i charakterystyka komponentów. \n    Ocena systemów  w aspektach: tworzenia modeli i analizy danych.\n    Architektura systemów przetwarzania danych (SPD)\n    Wielowymiarowy model danych, \n    Modele logiczne SPD, Tworzenia schematów SPD na podstawie wymagań\n   ETL- ekstrakcja, transformacja i ładowanie danych część 1\n  ETL- ekstrakcja, transformacja i ładowanie danych część 2\nPrzetwarzanie i optymalizacja zapytań Podstawy tworzenia raportów w SQL Server Reporting\n  Graficzna prezentacja analizowanych danych ", "Hurtownie danych": "Tematyka wykładów:\n·          Wprowadzenie do hurtowni danych\n·          Podstawowe obiekty hurtowni danych\n·          Zasady tworzenia i zarządzania hurtowniami danych\n·          Wstęp do języka MDX.\n·          Rozbudowa funkcjonalności kostek.\n·          Wdrażanie i przetwarzanie hurtowni i jej elementów.\n·          Polityka bezpieczeństwa.\n·          Wykorzystanie hurtowni do analizy danych\n·          Wprowadzenie do data mining.\nTematyka ćwiczeń laboratoryjnych: \n·          Wprowadzenie do środowiska Analysis Services\n·          Definiowanie źródeł danych i widoków źródeł danych\n·          Tworzenie kostek\n·          Tworzenie wymiarów i hierarchii\n·          Tworzenie zapytań MDX do kostek i wymiarów\n·          Tworzenie KPI, akcji, tłumaczeń.\n·          Wdrażanie hurtowni danych i jej elementówq na serwerze.\n·          Konfigurowanie przetwarzania obiektów hurtowni danych\n·          Zarządzenie uprawnieniami\n·          Tworzenie i korzystanie z modeli data mining. Porównywanie modeli. ", "Systemy wbudowane": "Definicja oraz schemat sterowania systemem wbudowanym Definicja, architektura oraz tryby adresowania mikrokontrolera. Schematy blokowe i elementy systemów sterujących Komputerowe systemy pomiarowo-sterujące Kanały automatyki - układy wejść i wyjść Komunikacja mikrokontrolera ze światem zewnętrznym. Oprogramowanie komputerowych systemów sterowania Programowanie sterowników PLC Diagnostyka układów analogowych Protokoły transmisyjne Architektura i zastosowania technologii inteligentnego budynku Programowanie mikrokontrolera DSM8051 ", "Systemy rozproszone": "Cechy systemu rozproszonego: przezroczystość (położenia, dostępu, wędrówki, zwielokrotnienia, współbieżności, trwałości, względem awarii), otwartość (protokoły i interfejsy), skalowalność, problemy synchronizacji (brak globalnego zegara), komunikacja synchroniczna i asynchroniczna. DNS jako przykład systemu rozproszonego. Komunikacja przy pomocy gniazdek sieciowych (socketów). Mechanizmy wywoływania zdalnych procedur (RPC); przykładowe implementacje: XML-RPC, JSON-RPC, itd.\r\nArchitektura web serwisów i mikroserwisów. Architektura REST. Interoperacyjność usług i komponentóœ sieciowych.\r\nREST API i Web API w nowoczesnych systemach rozproszonych.\r\nNarzędzia Message-Oriented Middleware na przykładzie RabbitMQ (ew. Kafka, Iris Message Queue, itd.) Rozproszone systemy plików: NFS, Samba, Lustre, Ceph, itd. Bezpieczeństwo i autoryzacja w systemach rozproszonych. Kerneros, TLS, JWT, OAuth2, itd. Klastry, gridy, chmury i superkomputery.\r\nNarzędzia wykorzystywane przy pracy w chmurze.\r\nBezpieczeństwo i zagrożenia związane z wykorzytsaniem chmur obliczeniowych. ", "Usługi sieciowe": "Przypomnienie informacji na temat sieci komputerowych, warstw sieciowych, urządzeń sieciowych, stosie  TCP/IP na systemach operacyjnych. Ogólnie informacje na temat istniejących usług sieciowych, podział i przydatność usług sieciowych, obecne trendy i trudności z wdrażaniem. Usługa DNS. Założenia usługi DNS. Hierarchiczna i rekurencyjna architektura.Przykład dialogu DNS klient-serwer. Rodzaje rekordów zasobów. Delegacje DNS i propagacja DNS. Tworzenie stref DNS. Protokół i usługa DHCP - dynamicznej konfiguracji IP hostów. Omówienie szczegółowe protokołu DHCP. Tworzenie puli DHCP, rezerwacji MAC, wykluczeń. Działanie DHCP Relay i zastosowania. Tworzenie klas użytkowników. Protokół HTTP. Struktura komunikatów HTTP. Specyfikacja MIME. Uwierzytelnianie metodą Basic Authentication. Zmienne Cookies. Buforowanie dokumentów. HTTP Persistent Connections. Serwery HTTP Proxy.Bezpieczny protokół HTTPS. Usługa SMTP/POP3/IMAP. Omówienie usługi i protokołów. Zalet i wady rozwiązań. Metody zabezpieczeń. Usługa FTP. Omówienie różnic i problemów pomiędzy pracą pasywną a pracą aktywną. Metody zabezpieczenia. Usługa NAT- translacji adresów sieciowych. Uzycie adresow nierutowalnych w sieci do wewnetrznej adresacji podsieci. Zalety i wady usługi. Techniki SNAT vs DNAT. Podział łącza internetowego. Usługa zapory sieciowej- Firewall. Praca bezstanowa vs stanowa. Omówienie wdrożenia na podsatwie iptables w systemie Linux. Metody zapewnie wysokiej jakości usługi QoS. Podział łącza i ograniczenia.Omówienie algorytmów kolejkowania  HTB, bezklasowego algorytmu kolejkowania SFQ. Metody filtracji. Usługa VPN czesc 1- tworzenie wirtualnych sieci prywatnych. Omówienie protokołu IPsec, PPTP, implementacji OpenVPN. Usługa VPN czesc 2- tworzenie wirtualnych sieci prywatnych. Omówienie protokołu IPsec, PPTP, implementacji OpenVPN. Usługa RADIUS - usługa zdalnego uwierzytelniania użytkowników. Funkcjonowanie protokołu RADIUS. Zastosowanie w sieciach bezprzewodowych. Usługa RADIUS - usługa zdalnego uwierzytelniania użytkowników. Funkcjonowanie protokołu RADIUS. Zastosowanie w sieciach bezprzewodowych. Usługa Active Directory/LDAP. Omówienie usługi i protokołu. Działanie AD DC oraz zapasowej usługi. Czesc 2. Kolokwium / Projekt. ", "Bezpieczeństwo sprzętowe": "Wprowadzenie do bezpieczeństwa sprzętowego: Definicja, historia, podstawowe pojęcia.\nZagrożenia związane z bezpieczeństwem sprzętowym: Typy ataków, profile zagrożeń, przykładowe scenariusze.\nBezpieczeństwo pamięci i przechowywania danych: Ataki na pamięć RAM, bezpieczeństwo dysków twardych i SSD, techniki szyfrowania.\nBezpieczeństwo BIOS i UEFI: Ataki na BIOS/UEFI, zabezpieczenia, aktualizacje firmware.\nBezpieczeństwo mikrokontrolerów i mikroprocesorów: Ataki na procesory, zabezpieczenia, aktualizacje.\nBezpieczeństwo systemów wbudowanych: Problemy bezpieczeństwa w systemach wbudowanych, IoT.\nAtaki sprzętowe i ich wykrywanie: Side-channel attacks, fault injection, hardware Trojans.\nZabezpieczenia sprzętowe: TPM, HSM, Secure Boot, techniki obronne.\nBezpieczeństwo sieciowe i sprzętu sieciowego: Ataki na routery, przełączniki, zabezpieczenia sieciowe.\nBezpieczeństwo mobilne i sprzętowe: Zagrożenia związane z bezpieczeństwem sprzętowym w urządzeniach mobilnych.\nStandardy i regulacje dotyczące bezpieczeństwa sprzętowego: NIST, ISO, inne standardy przemysłowe.\nTestowanie bezpieczeństwa sprzętowego: Techniki testowania, narzędzia, praktyki.\nCase study: Analiza znanych ataków sprzętowych: Spectre, Meltdown, Rowhammer.\nPrzyszłość bezpieczeństwa sprzętowego: Trendy, wyzwania, kierunki rozwoju.\nPraktyczne zastosowania wiedzy o bezpieczeństwie sprzętowym: Praktyczne ćwiczenia, scenariusze i studia przypadków. ", "Podstawy przetwarzania dźwięku": "Fala akustyczna, percepcja dźwięku, problem hałasu (w tym metody pomiaru hałasu), akustyka pomieszczeń zamkniętych, przetworniki elektroakustyczne (mikrofony, głośniki, słuchawki), podstawowe informacje o nagłaśnianiu (przestrzeń otwarta, pomieszczenia zamknięte), rejestracja dźwięku (różne techniki), odtwarzanie dźwięku, filtrowanie i montaż nagrania, oprogramowanie specjalistyczne oraz tworzenie oprogramowania do przetwarzania dźwięku. ", "Wizualizacja danych": "Podstawy funkcjonowania systemu wizyjnego człowieka. Złudzenia optyczne a wizualizacja danych. Koncepcje i postrzeganie barw, użyteczne palety barw, barwy dobrze postrzegaane przez daltonistów, znaczenia przypisywane barwom. Zasady dobrej wizualizacji. Techniki: wyróżnianie w kontekście; mapy; czas; wykresy kołowe; mapy drzewiaste; małe wielokrotności; dane wielowymiarowe; przeciążanie elementów graficznych; wizualizacje wysokiej rozdzielczości. Wizualizacja wspierająca statystykę: kwantyle; wykresy kwantyl-kwantyl (q-q), średnia-różnica (m-d), rozrzut rezydua-dopasowanie (r-f spread), rozrzut-lokalizacja (s-l); transformacje usuwające skośność danych. Przykłady dobrych i złych wizualizacji i dyskusja and ich zaletami i wadami. ", "Symulacja komputerowa": "Pojęcie symulacji komputerowej. Model, symulacja, animacja, przykłady. Metody i techniki symulacji. Metody numeryczne rozwiązywania róniań różniczkowych zwyczajnych. Metody numeryczne rozwiązywania równań różniczkowyh cząstkowych (MRS, MES, inne). Zastosowania automatów komórkowych i systemów wielo-agentowych do symulacji komputerowych. Metody weryfikacji i analizy otrzymanych wyników symulacji komputerowych. Symulacje skończenie wymiarowych układów mechanicznych opisywanych fizyką klasyczną. Symulacje zjawiska dyfuzji, przewodnictwa cieplnego. Symulacje dynamiki cieczy i gazów. Symulacje przepływu wody w rzekach i kanałach. Symulacje rozchodzenia się zanieczyszczeń. Symulacje zjawisk falowych. Symulacje rozchodzenia się epidemii. Symulacje dynamiki populacji w bilogii (na przykład układu drapieżnik-ofiara). Symulacje w mechanice kwantowej. Symulacje w naukach społecznych. Symulacje zjawisk meterologicznych (prognozowanie pogody). Symulacje zjawisk związanych z teorią względności. Zastosowanie programowania w języku C# w trybie Windows.Forms z wykorzystaniem środowiska Visual Studio. Rozwiązywanie układów równań rózniczkowych zwyczajnych z zastosowaniem własnych algorytmów i metod wizualizacji. Symulacja prostych układów mechanicznych. Symulacja zjawisk falowych (struna, powierzchnia, ciało sprężyste). Symulacja rozchodzenia się epidemii oraz badanie i analiza otrzymywanych wyników. Symulacja układu drapieżnik-ofiara. Symulacja przepływu wody. Symulacja dynamiki postaw społecznych. Symulacja dynamiki bryły sztywnej. Symulacje zderzeń sprężystych. Przykłady symulacji z zastosowaniem automatów komórkowych. Symulacje z zastosowaniem systemów wielo-agentowych. Symulacje zjawiska dyfuzji. Symulacje przepływu ciepła. Symulacje układu planetarnego. Symulacja układów odniesienia w szczególnej teorii względności. Symulacje złożonych układów mechanicznych. ", "Aplikacje internetowe": "Wprowadzenie do technologii webowych: HTML, CSS, JavaScript.\nBudowa i działanie protokołu HTTP.\nBackend a frontend - różnice i zależności.\nNarzędzia dla programistów aplikacji internetowych (IDE, debuggery, narzędzia do kontroli wersji).\nWprowadzenie do frameworków front-endowych: React, Angular, Vue.js.\nWprowadzenie do frameworków back-endowych: Node.js, Django, Flask.\nProjektowanie baz danych dla aplikacji internetowych: SQL, NoSQL.\nBezpieczeństwo aplikacji internetowych: XSS, CSRF, SQL Injection.\nTestowanie aplikacji internetowych: unit testing, integration testing, end-to-end testing.\nResponsive Web Design: projektowanie aplikacji dla różnych rozdzielczości ekranów.\nWykorzystanie API i usług zewnętrznych w aplikacjach internetowych.\nWebsockets i komunikacja w czasie rzeczywistym.\nWydajność i optymalizacja aplikacji internetowych.\nPraktyczne zastosowania technologii PWA (Progressive Web Apps).\nDeployment i utrzymanie aplikacji internetowej: hosting, domeny, serwery. ", "Uczenie maszynowe w chmurze": "Cele kształcenia, środowiska programistyczne i narzędzia pracy, wykorzystywane w pracy przy modelowaniu algorytmów uczenia maszynowego na potrzeby chmury obliczeniowej. Chmura obliczeniowa (IaaS/PaaS): wirtualizacja sprzętowa i programowa, model chmury hybrydowej z wyszczególnieniem roli warstw infrastruktury, zarządzania, usług i integracji, standaryzacja i migracja procesów, katalog usług, automatyczna skalowalność, rozwiązania klastrowe, funkcje chmurowe. Przegląd usług z zakresu uczenia maszynowego dostępnych w formie usług (SaaS). Metody statystyczne i sieci neuronowe w analizie szeregów czasowych. Przetwarzanie języka naturalnego (tokenizacja, osadzanie słów, analiza morfologiczna, zastosowania metod zespołowych, płytkie i głębokie sieci neuronowe), algorytmów i narzędzi uczenia maszynowego, usługi sztucznej inteligencji w chmurze, sieci neuronowe, przetwarzanie języka naturalnego, wizualizacja wyników analizy danych Modele bezpieczeństwa chmury obliczeniowej. ", "Deep learning w chmurze": "Wprowadzenie do przetwarzania w chmurze i opis infrastruktury chmury. Zarządzanie danymi w chmurze. Usługi obliczeniowe i hostingowe w chmurze. Usługi sieciowe w chmurze i projektowanie platform usługowych. Analiza dużych zbiorów danych (Big Data) i usługi w chmurze do uczenia maszynowego/głębokiego (Cognitive Computing Defferentiable Programming). Oparte na chmurze platformy do zarządzania rozproszonymi danymi. Chmura hybrydowa i zdecentralizowane platformy obliczeniowe oraz powiązane usługi. Rozwiązania inteligentnych sieci autonomicznych (IAN) i dodatkowe kluczowe usługi. Przetwarzanie brzegowe (Edge Computing) i przetwarzanie we mgle (Fog Computing) oraz Internet Rzeczy (IoT) ", "Bezpieczeństwo usług chmurowych": "Wprowadzenie do bezpieczeństwa usług chmurowych: zagadnienia podstawowe i terminologia.\nArchitektura bezpieczeństwa w chmurze: publiczna, prywatna i hybrydowa.\nStandardy i regulacje dotyczące bezpieczeństwa chmury: przegląd norm ISO/IEC 27017 i 27018.\nZarządzanie tożsamością i dostępem (Identity and Access Management - IAM) w chmurze.\nBezpieczeństwo danych w chmurze: szyfrowanie, backup i odzyskiwanie danych.\nBezpieczeństwo sieci w chmurze: firewalle, detekcja intruzów i zapobieganie atakom DDoS.\nBezpieczeństwo aplikacji chmurowych: praktyki bezpiecznego kodowania i testowania penetracyjnego.\nRola dostawcy usług chmurowych w zarządzaniu bezpieczeństwem.\nZarządzanie ryzykiem i ocena ryzyka w chmurze.\nKontrola i audyt bezpieczeństwa chmury: narzędzia i techniki.\nZarządzanie incydentami bezpieczeństwa w chmurze.\nBezpieczeństwo prywatności w chmurze i zgodność z GDPR.\nBezpieczeństwo w chmurze a cyberbezpieczeństwo: strategie, technologie i najnowsze trendy.\nPrzypadki studiów dotyczące naruszeń bezpieczeństwa w chmurze i odpowiedzi na nie.\nPrzyszłość bezpieczeństwa usług chmurowych: wyzwania, możliwości i nadchodzące innowacje. ", "Programowanie w chmurze (CKAD)": "Zajęcie 1: Wprowadzenie do Kubernetes\nPrzegląd architektury Kubernetes.\r\nInstalacja i konfiguracja lokalnego środowiska Kubernetes (minikube).\r\nZrozumienie podstawowych elementów Kubernetes: Pod, Service, Namespace.\r\nPraktyczne ćwiczenia z podstawowymi elementami.\n\r\nZajęcie 2: Praca z kubectl\nPodstawowe polecenia kubectl.\r\nZarządzanie zasobami Kubernetes za pomocą kubectl.\r\nPraktyczne ćwiczenia z kubectl.\nZajęcie 3: Podstawy YAML i manifesty Kubernetes\nWprowadzenie do YAML.\r\nPisząc manifesty Kubernetes.\r\nPraktyczne ćwiczenia z pisaniem manifestów.\nZajęcie 4: Podstawy Deployment i ReplicaSet\nWprowadzenie do Deployment i ReplicaSet.\r\nZarządzanie Deploymentami i ReplicaSetami.\r\nPraktyczne ćwiczenia z Deploymentami i ReplicaSetami.\nZajęcie 5: Praca z usługami sieciowymi\nPodstawy usług sieciowych w Kubernetes.\r\nZarządzanie usługami sieciowymi.\r\nPraktyczne ćwiczenia z usługami sieciowymi.\nZajęcie 6: Ingress i Ingress Controllers\nWprowadzenie do Ingress i Ingress Controllers.\r\nKonfiguracja Ingress w środowisku Kubernetes.\r\nPraktyczne ćwiczenia z Ingress.\nZajęcie 7: Podstawy Persistent Volumes i Persistent Volume Claims\nWprowadzenie do Persistent Volumes (PV) i Persistent Volume Claims (PVC).\r\nZarządzanie PV i PVC.\r\nPraktyczne ćwiczenia z PV i PVC.\nZajęcie 8: Konfiguracja i zarządzanie ConfigMaps i Secrets\nWprowadzenie do ConfigMaps i Secrets.\r\nZarządzanie ConfigMaps i Secrets.\r\nPraktyczne ćwiczenia z ConfigMaps i Secrets.\nZajęcie 9: Wprowadzenie do StatefulSet\nRóżnica między Deployment a StatefulSet.\r\nZarządzanie StatefulSet.\r\nPraktyczne ćwiczenia ze StatefulSet.\nZajęcie 10: Zrozumienie i zarządzanie Jobs i CronJobs\nWprowadzenie do Jobs i CronJobs.\r\nZarządzanie Jobs i CronJobs.\r\nPraktyczne ćwiczenia z Jobs i CronJobs.\nZajęcie 11: Monitoring i logowanie\nWprowadzenie do monitoringu i logowania w Kubernetes.\r\nUżywanie narzędzi do monitoringu i logowania, takich jak Prometheus i Grafana.\r\nPraktyczne ćwiczenia z monitoringu i logowania.\nZajęcie 12: Podstawy bezpieczeństwa w Kubernetes\nWprowadzenie do bezpieczeństwa w Kubernetes.\r\nZarządzanie dostępem i uprawnieniami za pomocą Role-Based Access Control (RBAC).\r\nPraktyczne ćwiczenia z RBAC.\nZajęcie 13: Wprowadzenie do Helm\nZrozumienie, jak Helm upraszcza zarządzanie aplikacjami w Kubernetes.\r\nInstalacja i konfiguracja Helm.\r\nPraktyczne ćwiczenia z Helm.\nZajęcie 14: Wprowadzenie do Operators\nWprowadzenie do Kubernetes Operators.\r\nJak tworzyć i korzystać z Operators.\r\nPraktyczne ćwiczenia z Operators.\nZajęcie 15: Przygotowanie do egzaminu CKAD\nPrzegląd tematów egzaminu CKAD.\r\nPorady dotyczące egzaminu.\r\nPraktyczne ćwiczenia z pytaniami z poprzednich egzaminów.\r\nPodsumowanie kursu i dyskusja o dalszym rozwoju umiejętności w Kubernetes. ", "Sztuczna inteligencja": "Dedukcja i wnioskowalność. Rachunek Zdań i Rachunek Predykatów. Modele, logiczne konsekwencje oraz spełnialność. Refutacja, klauzule Horna i rezolucja SLD. Programowanie w PROLOG-u – paradygmat programowania deklaratywnego. Arytmetyka symboliczna i listy. Przeszukiwanie grafu w PROLOG-u (cyklicznego i acyklicznego). Zastosowania PROLOGU-u w sztucznej inteligencji. Interpretacje i modele Herbranda. Najmniejszy model Herbranda. Wstęp do programowania (przeszukiwanie grafów acyklicznych). Arytmetyka symboliczna w Prologu. Listy w Prologu Zagadki logiczne (zagadka z zebrą Einsteina) Grafy cykliczne i ich przeszukiwanie (gra planszowa). ", "Komunikacja międzykulturowa": "Podstawowe pojęcia komunikacji międzykulturowej: szok kulturowy, adaptacja, integracja, asymilacja, kultura. Komunikacja, etnocentryzm, relatywizm kulturowy, stereotypy, uprzedzenia. Kulturowe zróżnicowanie komunikacja werbalnej i niewerbalnej. Bariery w komunikacji międzykulturowej. Zróżnicowanie kulturowe w unikaniu niepewności.  Globalizacja i zmiana kulturowa. Typologia i charakterystyka kultur. 7)     Komunikacja międzykulturowa w gospodarce i edukacji. ", "Cyberterroryzm, wojny hybrydowe i międzynarodowe zagrożenia cyberbezpieczeństwa": "Pojęcia funkcjonujące w obszarze cyberterroryzmu, wojen hybrydowych oraz międzynarodowego zagrożenia cyberbezpieczeństwa.\nWojna cybernetyczna i przestępczość komputerowa.\nElementy kluczowe krytycznej infrastruktury państwa jako obiekty szczególnie narażone na ataki cyberterrorystyczne.\nOchrona cyberprzestrzeni Rzeczypospolitej Polskiej.\nMiedzynarodowe zagrożenia cyberbezpieczeństwa.\nWojny hybrydowe - definicje i historia, przykłady.\nMetody stosowane przez cyberterrorystów.\nKonsekwencje ataków cyberterrorystycznych. ", "Systemy Business Intelligence": "Tematyka wykładów:\r\n·           Wprowadzenie do Business Intelligence (BI)\n- historia BI, BI jako dziedzina na styku biznesu i technologii\n- przegląd zastosowań BI w wybranych obszarach praktyki biznesowej\n- wspomaganie decyzji zarządczych z wykorzystaniem technologii informatycznych;\n·           Warstwa technologiczna systemów BI \n- architektura systemów BI\n- źródła danych, proces ekstrakcji, transformacji, ładowania, hurtownia danych,\n- narzędzia OLAP, narzędzia eksploracji, narzędzia zarządzania wiedzą;\n·          Przetwarzanie danych w ramach systemów BI\n- model danych, podstawowe operacje na danych\n- metody przetwarzania danych i języki przetwarzania danych (m.in. SQL, SAS 4GL)\n- raportowanie i analiza danych\n·          Zaawansowana analityka biznesowa\n- wprowadzenie do eksploracji danych, wielowymiarowa analiza danych\n- przegląd podstawowych technik data mining\n·          Przegląd oferty dostawców systemów BI (Oracle, SAS, Microsoft, GramSoftware, StatSoft)\n \n Tematyka ćwiczeń laboratoryjnych: \r\n \nTreści prezentowane na wykładach zostaną uzupełnione ćwiczeniami w laboratorium komp. i będą dotyczyły strony praktycznej tj. poznania rozwiązań dostępnych w ramach systemów Business Intelligence, co w szczególności obejmie:\n·          Przetwarzanie danych w systemach BI\n·          Języki przetwarzania danych (4GL i SQL)\n·          Składna podstawowych bloków operacji na tabelach danych\n·          Zbiory danych w systemie SAS i operacje na zbiorach\n·          Zaczytywanie zbiorów danych, czytanie wybranych zmiennych w tabelach, łączenie tabel\n·          Omówienie podstawowych formatów danych, operatorów i ważniejszych funkcji\n·          Obliczenia na danych, przetwarzanie iteracyjne, pętle, sortowanie\n·          Wykorzystanie podstawowych techniki eksploracji wiedzy (drzew decyzyjnych, reguł asocjacyjnych, sieci neuronowych)\n·          Praktyka systemów BI m.in. w finansach, przemyśle, medycynie, nauce, telekomunikacji ", "Systemy handlu elektronicznego": "Analiza elementów sklepu internetowego związanych z wymogami prawa: polityki, regulaminy, zgody obowiązkowe, zgody opcjonalne itp. Wykonanie prostego rozwiązania e-commerce zgodnego z zasadami SEO oraz psychologii sprzedaży np. Call for Action. Wykonanie kompleksowego, zintegrowanego sklepu internetowego w oparciu o narzedzia open-source. ", "Systemy mobilne i komunikacja bezprzewodowa": "Podstawy cyfrowego przetwarzania sygnałów.\nPróbkowanie, kwantowanie, rekonstrukcja sygnałów. Filtry cyfrowe, ich projektowanie i znaczenie w systemach transmisji cyfrowej. Modulacje analogowe: DSB, AM, FM, PM, SSB, VSB. Modulacje impulsowe: \nPCM – (ang. Pulse-Code Modulation) impulsowo-kodowa\r\nDPCM – (ang. Differential Pulse-Code Modulation) różnicowa impulsowo-kodowa\r\nPWM – (ang. Pulse-Width Modulation) szerokości impulsów\r\nPAM – (ang. Pulse-Amplitude Modulation) amplitudy impulsów\r\nPPM – (ang. Pulse-Position Modulation) położenia impulsu\r\nPDM – (ang. Pulse-Density Modulation) gęstości impulsów. Kluczowanie:\nASK – (ang. Amplitude Shift Keying) amplitudowe\r\nQAM – (ang. Quadrature Amplitude Modulation)\r\nFSK – (ang. Frequency-Shift Keying) częstotliwościoweMFSK – (ang. Multiple Frequency-Shift Keying) wieloczęstotliwościowe\r\nGFSK – (ang. Gaussian Frequency Shift Keying) częstotliwościowe z filtrem Gaussowskim\r\nMSK – (ang. Minimum Shift Keying) minimalnofazowe\r\nGMSK – (ang. Gaussian Minimum Shift Keying) minimalnofazowe z filtrem Gaussowskim\r\nPSK – (ang. Phase-Shift Keying) fazowe, czyli PM np. BPSK, DPSK, QPSK, n-PSK, O-QPSK,  -QPSK,  -PSK\r\nSystemy szerokopasmoweDSSS – (ang. Direct Sequence Spread Spectrum) systemy z bezpośrednim rozpraszaniem widma\r\nFHSS – (ang. Frequency Hopping Spread Spectrum) systemy szerokopasmowe ze skakaniem po częstotliwościach\r\nPulsed-FM\r\nOFDM – (ang. Ortogonal Frequency Division Multiplexing) nazywane też DMT (ang. Discrete Multitone Modulation)\r\nCDMA – (ang. Code Division Multiple Access) systemy wielodostępowe z zastosowaniem sekwencji rozpraszających\r\nRTTY – dalekopis na falach radiowych (ang. Radio TeleTYpe) – prosta modulacja impulsowo-kodowa Metody modulacji i kodowania sygnałów w sieciach WLAN, Bluetooth, w telefonii komórkowej i nawigacji satelitarnej. Struktura sygnałów w komunikacji bezprzewodowej. Topologia i architektura sieci komórkowych Struktura sieci WLAN i Bluetooth Zasada działania nawigacji satelitarnej Zagadnienie bezpieczeństwa w komunikacji bezprzewodowej ", "Bezpieczeństwo systemów komputerowych": "Wprowadzenie do bezpieczeństwa systemów komputerowych, historia i kierunki rozwoju, podstawowe problemy bezpieczeństwa, normy i zalecenia\r\nMechanizmy ochrony przed włamaniami do systemów komputerowych, problemy ochrony popularnych usług, metody i ataki, przestępstwa komputerowe, mechanizmy uwierzytelniania\r\nBezpieczeństwo systemów operacyjnych, system Linux i Windows   \r\nZabezpieczenie systemów w oparciu o firewalle\r\nWykrywanie włamań, systemy IPS/ IDS\r\nZabezpieczenie systemów przed atakami DoS i DDoS\r\nMechanizmy kontroli dostępu do systemów komputerowych. Funkcje skrótu, hasła, ataki \r\nElementy kryptografii, szyfry symetryczne, szyfry asymetryczne, zarządzanie kluczami (PKI), uwierzytelnianie kryptograficzne, narzędzia, prawne aspekty wykorzystania kryptografii \r\nSzyfrowanie danych, sieci i tunele VPN, IPSec\r\nMetody wdrażania mechanizmów bezpieczeństwa w oparciu o listy kontroli dostępu ACL\r\nBezpieczeństwo usług VoIP\r\nBezpieczeństwo aplikacji użytkowych i usług, analizatory ruchu Zabezpieczenie systemów komputerowych, połączenia szyfrowane, hasła, poziomy dostępu \r\nSzyfrowanie danych, funkcje skrótu, kryptografia\r\nKonfiguracja firewalla  implementacja i testy\r\nSystemy wykrywania włamań IPS/IDS konfiguracja\r\nZabezpieczenie danych z wykorzystaniem tuneli IPSec\r\nTypowe ataki - rozpoznanie, dostęp, narzędzia\nBezpieczeństwo VoIP\r\nBezpieczeństwo danych (plików) Polityka haseł ", "Cyfrowe przetwarzanie obrazu": "·         Metody pozyskiwania obrazów\n·         Reprezentacja obrazu w pamięci\n·         Metody bezkontekstowe przetwarzania obrazów\n·         Metody kontekstowe przetwarzania obrazów\n·         Filtracja dolno i górno przepustowa\n·         Metody częstotliwościowe przetwarzania obrazów\n·         Elementy morfologii matematycznej\n·         Przetwarzanie obrazów z wybranych dziedzin\n·         Algorytmy odczytujące kody kreskowe Projekt - tworzenie systemu do łamania prostej captchy ", "Animacja komputerowa": "Wprowadzenie: percepcja ruchu, podstawowe zasady animacji, animacja proceduralna, pojęcie rozwarstwienia obrazu oraz blue screen, systemy mocap, rzeczywistość wzmocniona (Augmented Reality).\nPotok obrazu, współrzędne homogeniczne oraz macierz transformacji, przekształcenia afiniczne, reprezentacja stało-kątowa, pojęcie kwaternionu i jego właściwości, rotacja wektorów przy pomocy kwaternionów. Śledzenie krzywej, krzywej wielomianowe/wymierne, złożoność równań interpolujących, ciągłość krzywej śledzonej, sterowanie globalne oraz lokalne, interpolacja Catmull-Rom, krzywa przestrzenna, metoda analityczna liczenia długości łuku, estymacja długości łuku przy pomocy skończonych różnic (forward differencing).\nKontrola prędkości śledzenia krzywej, funkcje krzywych napięcia (ease-in, ease-out), interpolacja sinusoidalna, dopasowywanie krzywych do par pozycja-czas, interpolacja rotacji przy pomocy kwaternionów, wygładzanie przez liniową/sześcienną interpolację wartości sąsiadujących. Model hierarchiczny kinematyki, metody sterowania nim, kinematyka prosta, pojęcie ramki współrzędnych lokalnych i konstrukcja jej opisu, notacja Denavita - Hartenberga, stawy planarne oraz stawy kuli-i-panewki (ball-and-socket).\nKinematyka odwrotna, macierz Jakobiego oraz jej inwersja w inkrementacyjnej konstrukcji ruchu, dekompozycja LU. Symulacja ciała w swobodnym spadaniu oraz w trakcie kolizji, obiekty elastyczne, wirtualne sprężyny, ograniczenia czasoprzestrzenne, sterowanie grupą obiektów, systemy cząsteczkowe, zachowania stadne oraz autonomiczne. Animacja chodu oraz twarzy. Animacja 3d z wykorzystaniem środowiska Blender.\nWykorzystanie kinematyki odwrotnej oraz funkcji napięcia do animacji kończyny oraz kontroli jej prędkości.\nAnimacja symulująca fizykę. ", "Metody Data Mining": "1.     Dwie kultury analizy danych – statystyczna i algorytmiczna, główne kierunki rozwoju metod data mining\n2.     Wielowymiarowe techniki analityczne, techniki imputacji braków danych, obserwacje odstające, metody redukcji wymiaru Wprowadzenie do problemów klasyfikacji oraz regresji, Liniowe i addytywne modele wielowymiarowe\n   Omówienie klasycznych metod data mining z zakresu scoringu\n\n\n\n Klasyczne modele dyskryminacyjne\n Nieparametryczne modele dyskryminacyjne\n Modele projekcji rzutowej  - sztuczne sieci neuronowe\n Algorytmy indukcyjne – drzewa decyzyjne\n\n\n Omówienie zaawansowanych metod data mining z zakresu scoringu\n\n\n\n Bagging\n  Boosting Gradient\n Lasy losowe Selekcja zmiennych i przypisywanie im wag\nMiary dopasowania modeli Data Miningowych (Goodness-of-Fit)\nZastosowania i wybór optymalnych modeli ", "Komercjalizacja wiedzy w IT": "Definicja pojęć podstawowych: komercjalizacja, wdrożenia, transfer technologii K&W&TT.\nDefinicje obowiązujące w systemie prawnym oraz działalności NCBR.\nSposoby pomiaru komercjalizacji, wdrożeń i transferu technologii w wybranych instytucjach w Polsce i w wybranych państwach na świecie.\nPraktyki wybranych państw w zakresie wspierania procesu K&W&TT.\nAnaliza doświadczeń wybranych państw oraz dobre praktyki w zakresie K&W&TT.\nKryteria doboru ekspertów reprezentujących strony procesu innowacyjnego.\nZakres danych i informacji zawartych w raporcie wdrożeniowym. "}